[NoCoverage] Equality mutation
Features/PasswordHashing/HashAlgo.cs:51:17
 
 
 
-            if (initialHash == reHashedPassword)
+            if (initialHash != reHashedPassword)
                 return true;
             return false;

[NoCoverage] Boolean mutation
Features/PasswordHashing/HashAlgo.cs:52:24
 
 
             if (initialHash == reHashedPassword)
-                return true;
+                return false;
             return false;
         }
