[Killed] Block removal mutation
Base/BaseService.cs:19:9
         //protected readonly EditUserDto EditUser;
 
         public BaseService(ServiceDependencies serviceDependencies)
-        {
-            UnitOfWork = serviceDependencies.UnitOfWork;
-            CurrentUser = serviceDependencies.CurrentUser;
-        }
+        {}
 
         protected TResult ExecuteInTransaction<TResult>(Func<UnitOfWork, TResult> func)

[NoCoverage] Equality mutation
Base/BaseService.cs:26:17
 
         protected TResult ExecuteInTransaction<TResult>(Func<UnitOfWork, TResult> func)
         {
-            if (func == null) { throw new ArgumentNullException(nameof(func)); }
+            if (func != null) { throw new ArgumentNullException(nameof(func)); }
 
             using (var transactionScope = new TransactionScope())

[NoCoverage] Statement mutation
Base/BaseService.cs:26:33
 
         protected TResult ExecuteInTransaction<TResult>(Func<UnitOfWork, TResult> func)
         {
-            if (func == null) { throw new ArgumentNullException(nameof(func)); }
+            if (func == null) { ; }
 
             using (var transactionScope = new TransactionScope())

[NoCoverage] Statement mutation
Base/BaseService.cs:32:17
             {
                 var result = func(UnitOfWork);
 
-                transactionScope.Complete();
+                ;
 
                 return result;

[NoCoverage] Statement mutation
Base/BaseService.cs:40:35
 
         protected void ExecuteInTransaction(Action<UnitOfWork> action)
         {
-            if (action == null) { throw new ArgumentNullException(nameof(action)); }
+            if (action == null) { ; }
 
             using (var transactionScope = new TransactionScope())

[NoCoverage] Equality mutation
Base/BaseService.cs:40:17
 
         protected void ExecuteInTransaction(Action<UnitOfWork> action)
         {
-            if (action == null) { throw new ArgumentNullException(nameof(action)); }
+            if (action != null) { throw new ArgumentNullException(nameof(action)); }
 
             using (var transactionScope = new TransactionScope())

[NoCoverage] Statement mutation
Base/BaseService.cs:44:17
 
             using (var transactionScope = new TransactionScope())
             {
-                action(UnitOfWork);
+                ;
 
                 transactionScope.Complete();
