[Timeout] Block removal mutation
Base/ServiceDependencies.cs:18:9
 
 
         public ServiceDependencies(UnitOfWork unitOfWork, CurrentUserDto currentUser)
-        {
-            UnitOfWork = unitOfWork;
-            CurrentUser = currentUser;
-
-        }
+        {}
     }
 }
