[NoCoverage] Block removal mutation
Services/TokenManager.cs:30:9
                              SignInKeySetting signInKeySetting,
                              LoginTokenConfig loginTokenConfig,
                              ServiceDependencies dependencies) :base(dependencies)
-        {
-            _refreshTokenConfig = refreshTokenConfig;
-            _signInKeySetting = signInKeySetting;
-            _loginTokenConfig = loginTokenConfig;
-        }
+        {}
 
 

[NoCoverage] Statement mutation
Services/TokenManager.cs:56:14
                 ExpirationDate = token.ValidTo
             });
 
-             UnitOfWork.SaveChanges();
+             ;
             var tuple = new Tuple<string, string>(tokenStringValue, refreshToken);
             return tuple;

[NoCoverage] Array initializer mutation
Services/TokenManager.cs:66:46
         {
 
 
-            var subject = new ClaimsIdentity(new Claim[] {
-                     new Claim(ClaimTypes.Email,user.Email),
-                     new Claim(ClaimTypes.Name,user.Username),
-                     new Claim(ClaimTypes.NameIdentifier,user.Id.ToString()),
-                     new Claim(JwtRegisteredClaimNames.Jti,newJti),
-                     new Claim("NumberOfAllowedRefreshes",_refreshTokenConfig.NumberOfRefreshes),
-                     new Claim("IntervalOfUseOfRefreshTokenAfterTokenHasExpired",_refreshTokenConfig.TimeLeftUntilRefreshTokenExpiresAfterTokenAlreadyExpired),
-                     new Claim(ClaimTypes.Role, roles)
-
-             });
+            var subject = new ClaimsIdentity(new Claim[] {});
    
             var tokenDescriptor = new SecurityTokenDescriptor

[NoCoverage] Object initializer mutation
Services/TokenManager.cs:77:35
 
              });
    
-            var tokenDescriptor = new SecurityTokenDescriptor
-            {
-                Subject = subject,
-                Issuer = _refreshTokenConfig.Issuer,
-                Audience = _refreshTokenConfig.Audience,
-                // Expires = DateTime.UtcNow.AddDays(Int32.Parse(_loginTokenConfig.Days)),
-                Expires = DateTime.UtcNow.AddMinutes(1),
-                SigningCredentials = new SigningCredentials(signinKey, SecurityAlgorithms.HmacSha256),
-            };
+            var tokenDescriptor = new SecurityTokenDescriptor
+{};
             var token = tokenHandler.CreateToken(tokenDescriptor);
             return token;

[NoCoverage] Statement mutation
Services/TokenManager.cs:96:17
             var randomNumber = new byte[32];
             using (var rng = RandomNumberGenerator.Create())
             {
-                rng.GetBytes(randomNumber);
+                ;
                 return Convert.ToBase64String(randomNumber);
             }

[NoCoverage] Linq method mutation (First() to FirstOrDefault())
Services/TokenManager.cs:109:23
             var jsonToken = handler.ReadToken(token);
             var decodedToken = jsonToken as JwtSecurityToken;
 
-            var jti = decodedToken.Claims.First(claim => claim.Type.Equals("jti")).ToString().Split(':')[1];
+            var jti = decodedToken.Claims.FirstOrDefault(claim => claim.Type.Equals("jti")).ToString().Split(':')[1];
             var roles = decodedToken.Claims.First(claim => claim.Type.Equals("role")).ToString().Split(':')[1];  //?
             var allowedRefreshes = decodedToken.Claims.First(claim => claim.Type.Equals("NumberOfAllowedRefreshes")).ToString().Split(':')[1]; //

[NoCoverage] String mutation
Services/TokenManager.cs:109:76
             var jsonToken = handler.ReadToken(token);
             var decodedToken = jsonToken as JwtSecurityToken;
 
-            var jti = decodedToken.Claims.First(claim => claim.Type.Equals("jti")).ToString().Split(':')[1];
+            var jti = decodedToken.Claims.First(claim => claim.Type.Equals("")).ToString().Split(':')[1];
             var roles = decodedToken.Claims.First(claim => claim.Type.Equals("role")).ToString().Split(':')[1];  //?
             var allowedRefreshes = decodedToken.Claims.First(claim => claim.Type.Equals("NumberOfAllowedRefreshes")).ToString().Split(':')[1]; //

[NoCoverage] Linq method mutation (First() to FirstOrDefault())
Services/TokenManager.cs:110:25
             var decodedToken = jsonToken as JwtSecurityToken;
 
             var jti = decodedToken.Claims.First(claim => claim.Type.Equals("jti")).ToString().Split(':')[1];
-            var roles = decodedToken.Claims.First(claim => claim.Type.Equals("role")).ToString().Split(':')[1];  //?
+            var roles = decodedToken.Claims.FirstOrDefault(claim => claim.Type.Equals("role")).ToString().Split(':')[1];  //?
             var allowedRefreshes = decodedToken.Claims.First(claim => claim.Type.Equals("NumberOfAllowedRefreshes")).ToString().Split(':')[1]; //
             var intervalOfUse = decodedToken.Claims.First(claim => claim.Type.Equals("IntervalOfUseOfRefreshTokenAfterTokenHasExpired")).ToString().Split(':')[1]; //

[NoCoverage] Linq method mutation (First() to FirstOrDefault())
Services/TokenManager.cs:111:36
 
             var jti = decodedToken.Claims.First(claim => claim.Type.Equals("jti")).ToString().Split(':')[1];
             var roles = decodedToken.Claims.First(claim => claim.Type.Equals("role")).ToString().Split(':')[1];  //?
-            var allowedRefreshes = decodedToken.Claims.First(claim => claim.Type.Equals("NumberOfAllowedRefreshes")).ToString().Split(':')[1]; //
+            var allowedRefreshes = decodedToken.Claims.FirstOrDefault(claim => claim.Type.Equals("NumberOfAllowedRefreshes")).ToString().Split(':')[1]; //
             var intervalOfUse = decodedToken.Claims.First(claim => claim.Type.Equals("IntervalOfUseOfRefreshTokenAfterTokenHasExpired")).ToString().Split(':')[1]; //
             var expirationDate = decodedToken.Claims.First(claim => claim.Type.Equals("exp")).ToString().Split(':')[1]; //

[NoCoverage] Linq method mutation (First() to FirstOrDefault())
Services/TokenManager.cs:112:33
             var jti = decodedToken.Claims.First(claim => claim.Type.Equals("jti")).ToString().Split(':')[1];
             var roles = decodedToken.Claims.First(claim => claim.Type.Equals("role")).ToString().Split(':')[1];  //?
             var allowedRefreshes = decodedToken.Claims.First(claim => claim.Type.Equals("NumberOfAllowedRefreshes")).ToString().Split(':')[1]; //
-            var intervalOfUse = decodedToken.Claims.First(claim => claim.Type.Equals("IntervalOfUseOfRefreshTokenAfterTokenHasExpired")).ToString().Split(':')[1]; //
+            var intervalOfUse = decodedToken.Claims.FirstOrDefault(claim => claim.Type.Equals("IntervalOfUseOfRefreshTokenAfterTokenHasExpired")).ToString().Split(':')[1]; //
             var expirationDate = decodedToken.Claims.First(claim => claim.Type.Equals("exp")).ToString().Split(':')[1]; //
 

[NoCoverage] Linq method mutation (First() to FirstOrDefault())
Services/TokenManager.cs:113:34
             var roles = decodedToken.Claims.First(claim => claim.Type.Equals("role")).ToString().Split(':')[1];  //?
             var allowedRefreshes = decodedToken.Claims.First(claim => claim.Type.Equals("NumberOfAllowedRefreshes")).ToString().Split(':')[1]; //
             var intervalOfUse = decodedToken.Claims.First(claim => claim.Type.Equals("IntervalOfUseOfRefreshTokenAfterTokenHasExpired")).ToString().Split(':')[1]; //
-            var expirationDate = decodedToken.Claims.First(claim => claim.Type.Equals("exp")).ToString().Split(':')[1]; //
+            var expirationDate = decodedToken.Claims.FirstOrDefault(claim => claim.Type.Equals("exp")).ToString().Split(':')[1]; //
 
             var tuple = new Tuple<string, string, string, string, string>(allowedRefreshes, intervalOfUse, expirationDate, jti, roles);

[NoCoverage] Boolean mutation
Services/TokenManager.cs:151:36
         {
             var tokenValidationParameters = new TokenValidationParameters
             {
-                ValidateAudience = true, // folosit sa valized audience si issuer setate in app.json
+                ValidateAudience = false, // folosit sa valized audience si issuer setate in app.json
                 ValidateIssuer = true,
                 ValidateIssuerSigningKey = true,

[NoCoverage] Boolean mutation
Services/TokenManager.cs:152:34
             var tokenValidationParameters = new TokenValidationParameters
             {
                 ValidateAudience = true, // folosit sa valized audience si issuer setate in app.json
-                ValidateIssuer = true,
+                ValidateIssuer = false,
                 ValidateIssuerSigningKey = true,
                 IssuerSigningKey = new SymmetricSecurityKey(Encoding.UTF8.GetBytes(_signInKeySetting.SecretSignInKeyForJwtToken)),

[NoCoverage] Boolean mutation
Services/TokenManager.cs:153:44
             {
                 ValidateAudience = true, // folosit sa valized audience si issuer setate in app.json
                 ValidateIssuer = true,
-                ValidateIssuerSigningKey = true,
+                ValidateIssuerSigningKey = false,
                 IssuerSigningKey = new SymmetricSecurityKey(Encoding.UTF8.GetBytes(_signInKeySetting.SecretSignInKeyForJwtToken)),
                 ValidateLifetime = true,

[NoCoverage] Boolean mutation
Services/TokenManager.cs:155:36
                 ValidateIssuer = true,
                 ValidateIssuerSigningKey = true,
                 IssuerSigningKey = new SymmetricSecurityKey(Encoding.UTF8.GetBytes(_signInKeySetting.SecretSignInKeyForJwtToken)),
-                ValidateLifetime = true,
+                ValidateLifetime = false,
                 ValidIssuer = _refreshTokenConfig.Issuer,
                 ValidAudience = _refreshTokenConfig.Audience

[NoCoverage] Boolean mutation
Services/TokenManager.cs:162:20
             var tokenHandler = new JwtSecurityTokenHandler();
             SecurityToken validatedToken;
             IPrincipal principal = tokenHandler.ValidateToken(token, tokenValidationParameters, out validatedToken);
-            return true;
+            return false;
         }
 

[NoCoverage] Block removal mutation
Services/TokenManager.cs:172:9
             return userTokenObj;
         }
         public async Task<IdentityUser> GetUserById(Guid id)
-        {
-            var user = await UnitOfWork.IdentityUsers.Get().Where(u => u.Id.Equals(id)).SingleOrDefaultAsync();
-            return user;
-        }
+        {}
 
         public async Task<TokenWrapper> Handle(RefreshTokenCommand request, CancellationToken cancellationToken)

[NoCoverage] Equality mutation
Services/TokenManager.cs:197:17
             //timespan
 
 
-            if (IdentityUserTokenObj == null)
+            if (IdentityUserTokenObj != null)
             {
                 throw new WasNotAbleToRefreshTokenException("");

[NoCoverage] Statement mutation
Services/TokenManager.cs:199:17
 
             if (IdentityUserTokenObj == null)
             {
-                throw new WasNotAbleToRefreshTokenException("");
+                ;
             }
 

[NoCoverage] String mutation
Services/TokenManager.cs:199:61
 
             if (IdentityUserTokenObj == null)
             {
-                throw new WasNotAbleToRefreshTokenException("");
+                throw new WasNotAbleToRefreshTokenException("Stryker was here!");
             }
 

[NoCoverage] Equality mutation
Services/TokenManager.cs:205:17
 
             TokenWrapper tokenwrapper = new TokenWrapper();
             bool isTokenVerified = IsTokenValid(request.LoginToken);
-            if (isTokenVerified == true)
+            if (isTokenVerified != true)
             {
                 if (tokenExpiration < DateTime.UtcNow.AddHours(3))

[NoCoverage] Boolean mutation
Services/TokenManager.cs:205:36
 
             TokenWrapper tokenwrapper = new TokenWrapper();
             bool isTokenVerified = IsTokenValid(request.LoginToken);
-            if (isTokenVerified == true)
+            if (isTokenVerified == false)
             {
                 if (tokenExpiration < DateTime.UtcNow.AddHours(3))

[NoCoverage] Equality mutation
Services/TokenManager.cs:207:21
             bool isTokenVerified = IsTokenValid(request.LoginToken);
             if (isTokenVerified == true)
             {
-                if (tokenExpiration < DateTime.UtcNow.AddHours(3))
+                if (tokenExpiration <= DateTime.UtcNow.AddHours(3))
                 {
                     if (tokenExpiration.AddMinutes(intervalOfUse) >= DateTime.UtcNow)//addhours +2

[NoCoverage] Negate expression
Services/TokenManager.cs:207:21
             bool isTokenVerified = IsTokenValid(request.LoginToken);
             if (isTokenVerified == true)
             {
-                if (tokenExpiration < DateTime.UtcNow.AddHours(3))
+                if (!(tokenExpiration < DateTime.UtcNow.AddHours(3)))
                 {
                     if (tokenExpiration.AddMinutes(intervalOfUse) >= DateTime.UtcNow)//addhours +2

[NoCoverage] Negate expression
Services/TokenManager.cs:209:25
             {
                 if (tokenExpiration < DateTime.UtcNow.AddHours(3))
                 {
-                    if (tokenExpiration.AddMinutes(intervalOfUse) >= DateTime.UtcNow)//addhours +2
+                    if (!(tokenExpiration.AddMinutes(intervalOfUse) >= DateTime.UtcNow))//addhours +2
                     {
                         if (allowedRefreshes != 0)

[NoCoverage] Equality mutation
Services/TokenManager.cs:209:25
             {
                 if (tokenExpiration < DateTime.UtcNow.AddHours(3))
                 {
-                    if (tokenExpiration.AddMinutes(intervalOfUse) >= DateTime.UtcNow)//addhours +2
+                    if (tokenExpiration.AddMinutes(intervalOfUse) < DateTime.UtcNow)//addhours +2
                     {
                         if (allowedRefreshes != 0)

[NoCoverage] Equality mutation
Services/TokenManager.cs:211:29
                 {
                     if (tokenExpiration.AddMinutes(intervalOfUse) >= DateTime.UtcNow)//addhours +2
                     {
-                        if (allowedRefreshes != 0)
+                        if (allowedRefreshes == 0)
                         {
                             allowedRefreshes = allowedRefreshes - 1;

[NoCoverage] Arithmetic mutation
Services/TokenManager.cs:213:48
                     {
                         if (allowedRefreshes != 0)
                         {
-                            allowedRefreshes = allowedRefreshes - 1;
+                            allowedRefreshes = allowedRefreshes + 1;
                             var claims = new ClaimsIdentity(new Claim[] {
                             new Claim(ClaimTypes.Email,user.Email),

[NoCoverage] Statement mutation
Services/TokenManager.cs:226:33
                         });
                             foreach (var role in roles)
                             {
-                                claims.AddClaim(new Claim(ClaimTypes.Role, role));
+                                ;
                             }
                             var tuple =  ReGenerateTokens(claims, IdentityUserTokenObj);

[NoCoverage] Statement mutation
Services/TokenManager.cs:237:29
                         }
                         else
                         {
-                            throw new MaximumRefreshesExceededException("You can't refresh the current token anymore. Please login again");
+                            ;
                         }
 

[NoCoverage] Statement mutation
Services/TokenManager.cs:248:25
                     }
                     else
                     {
-                        throw new IntervalOfRefreshTokenExpiredException("Please login again!");
+                        ;
                     }
                 }

[NoCoverage] String mutation
Services/TokenManager.cs:248:74
                     }
                     else
                     {
-                        throw new IntervalOfRefreshTokenExpiredException("Please login again!");
+                        throw new IntervalOfRefreshTokenExpiredException("");
                     }
                 }

[NoCoverage] Linq method mutation (Single() to SingleOrDefault())
Services/TokenManager.cs:264:26
 
             return ExecuteInTransaction(uow =>
             {
-                var id = uow.IdentityUsers.Get().Where(cd => cd.Email.Equals(email)).Select(cd => cd.Id).Single();
+                var id = uow.IdentityUsers.Get().Where(cd => cd.Email.Equals(email)).Select(cd => cd.Id).SingleOrDefault();
 
                 var comment = uow.IdentityUserTokens.Get()

[NoCoverage] Linq method mutation (Single() to SingleOrDefault())
Services/TokenManager.cs:266:31
             {
                 var id = uow.IdentityUsers.Get().Where(cd => cd.Email.Equals(email)).Select(cd => cd.Id).Single();
 
-                var comment = uow.IdentityUserTokens.Get()
-                                                .Where(cd => cd.UserId.Equals(id))
-                                                .Single();
+                var comment = uow.IdentityUserTokens.Get()
+                                                .Where(cd => cd.UserId.Equals(id))
+                                                .SingleOrDefault();
                 if (comment == null)
                 {

[NoCoverage] Statement mutation
Services/TokenManager.cs:273:17
                 {
                     return false;
                 }
-                uow.IdentityUserTokens.Delete(comment);
+                ;
                 uow.SaveChanges();
                 return true;

[NoCoverage] Statement mutation
Services/TokenManager.cs:274:17
                     return false;
                 }
                 uow.IdentityUserTokens.Delete(comment);
-                uow.SaveChanges();
+                ;
                 return true;
 
