[NoCoverage] Block removal mutation
Features/Register/RegisterCommand.cs:40:9
         private readonly IUserManager _userManager;
         private readonly ITokenManager _tokenManager;
         public RegisterCommandHandler(IUserManager userManager,  ITokenManager tokenManager)
-        {
-            _userManager = userManager;
-            _tokenManager = tokenManager;
-        }
+        {}
         public async Task<bool> Handle(RegisterCommand request, CancellationToken cancellationToken)
         {

[NoCoverage] Boolean mutation
Features/Register/RegisterCommand.cs:46:23
         }
         public async Task<bool> Handle(RegisterCommand request, CancellationToken cancellationToken)
         {
-            bool ok = false;
+            bool ok = true;
             var userProps = await _userManager.GetUserSelectedProperties(request.Email, user => new { user.Id, user.Email });
             if (userProps != null)

[NoCoverage] Equality mutation
Features/Register/RegisterCommand.cs:48:17
         {
             bool ok = false;
             var userProps = await _userManager.GetUserSelectedProperties(request.Email, user => new { user.Id, user.Email });
-            if (userProps != null)
+            if (userProps == null)
             {
 

[NoCoverage] String mutation
Features/Register/RegisterCommand.cs:51:34
             if (userProps != null)
             {
 
-                string message = $"Username={request.Email} already registered";
+                string message = $"";
                 throw new UserAlreadyRegisteredException(nameof(IdentityUser), message);
             }

[NoCoverage] Statement mutation
Features/Register/RegisterCommand.cs:52:17
             {
 
                 string message = $"Username={request.Email} already registered";
-                throw new UserAlreadyRegisteredException(nameof(IdentityUser), message);
+                ;
             }
             else

[NoCoverage] Statement mutation
Features/Register/RegisterCommand.cs:56:18
             }
             else
             {
-                 _userManager.Register(request);
+                 ;
                 ok = true;
 

[NoCoverage] Boolean mutation
Features/Register/RegisterCommand.cs:57:22
             else
             {
                  _userManager.Register(request);
-                ok = true;
+                ok = false;
 
             }
