[Killed] Block removal mutation
Services/AnnouncementManager.cs:17:9
         private readonly IUserManager _userAccountService;
         private readonly IAnnouncementRepository _announcementRepository;
         public AnnouncementManager(ServiceDependencies serviceDependencies, IUserManager userAccountService, IAnnouncementRepository announcementRepository) : base(serviceDependencies)
-        {
-            _userAccountService = userAccountService;
-            _announcementRepository = announcementRepository;
-        }
+        {}
 
         public List<AllAnnouncementsDto>? GetAllAnnouncementByFilters(bool meetingType, string subject, int price, int stars)

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Services/AnnouncementManager.cs:24:17
 
         public List<AllAnnouncementsDto>? GetAllAnnouncementByFilters(bool meetingType, string subject, int price, int stars)
         {
-            if (!Subjects.List.Contains(subject))
+            if (Subjects.List.Contains(subject))
             {
                 throw new Exception(ErrorMessages.SubjectNotValid);

[Killed] Statement mutation
Services/AnnouncementManager.cs:26:17
         {
             if (!Subjects.List.Contains(subject))
             {
-                throw new Exception(ErrorMessages.SubjectNotValid);
+                ;
             }
             if (price <= 0)

[Killed] Negate expression
Services/AnnouncementManager.cs:28:17
             {
                 throw new Exception(ErrorMessages.SubjectNotValid);
             }
-            if (price <= 0)
+            if (!(price <= 0))
             {
                 throw new Exception(ErrorMessages.PriceNotValid);

[Killed] Equality mutation
Services/AnnouncementManager.cs:28:17
             {
                 throw new Exception(ErrorMessages.SubjectNotValid);
             }
-            if (price <= 0)
+            if (price < 0)
             {
                 throw new Exception(ErrorMessages.PriceNotValid);

[Killed] Statement mutation
Services/AnnouncementManager.cs:30:17
             }
             if (price <= 0)
             {
-                throw new Exception(ErrorMessages.PriceNotValid);
+                ;
             }
             if (stars < 0 ||  stars > 5)

[Killed] Equality mutation
Services/AnnouncementManager.cs:32:31
             {
                 throw new Exception(ErrorMessages.PriceNotValid);
             }
-            if (stars < 0 ||  stars > 5)
+            if (stars < 0 ||  stars < 5)
             {
                 throw new Exception(ErrorMessages.StarsNotValid);

[Killed] Logical mutation
Services/AnnouncementManager.cs:32:17
             {
                 throw new Exception(ErrorMessages.PriceNotValid);
             }
-            if (stars < 0 ||  stars > 5)
+            if (stars < 0 &&  stars > 5)
             {
                 throw new Exception(ErrorMessages.StarsNotValid);

[Killed] Statement mutation
Services/AnnouncementManager.cs:34:17
             }
             if (stars < 0 ||  stars > 5)
             {
-                throw new Exception(ErrorMessages.StarsNotValid);
+                ;
             }
 

[Killed] Equality mutation
Services/AnnouncementManager.cs:39:17
 
             var announcementsByMeetingType =
                 _announcementRepository.GetAllAnnouncementByMeetingType(meetingType);
-            if (announcementsByMeetingType.Count > 0)
+            if (announcementsByMeetingType.Count >= 0)
             {
                 var result = new List<AllAnnouncementsDto>();

[Killed] Negate expression
Services/AnnouncementManager.cs:39:17
 
             var announcementsByMeetingType =
                 _announcementRepository.GetAllAnnouncementByMeetingType(meetingType);
-            if (announcementsByMeetingType.Count > 0)
+            if (!(announcementsByMeetingType.Count > 0))
             {
                 var result = new List<AllAnnouncementsDto>();

[Killed] Equality mutation
Services/AnnouncementManager.cs:42:84
             if (announcementsByMeetingType.Count > 0)
             {
                 var result = new List<AllAnnouncementsDto>();
-                var announcementsBySubject = announcementsByMeetingType.Where(m => m.Subject == subject).ToList();
+                var announcementsBySubject = announcementsByMeetingType.Where(m => m.Subject != subject).ToList();
                 if (announcementsBySubject.Count > 0)
                 {

[Killed] Equality mutation
Services/AnnouncementManager.cs:43:21
             {
                 var result = new List<AllAnnouncementsDto>();
                 var announcementsBySubject = announcementsByMeetingType.Where(m => m.Subject == subject).ToList();
-                if (announcementsBySubject.Count > 0)
+                if (announcementsBySubject.Count < 0)
                 {
                     var announcementsByPrice = announcementsBySubject.Where(m => m.Price <= price).ToList();

[Killed] Negate expression
Services/AnnouncementManager.cs:43:21
             {
                 var result = new List<AllAnnouncementsDto>();
                 var announcementsBySubject = announcementsByMeetingType.Where(m => m.Subject == subject).ToList();
-                if (announcementsBySubject.Count > 0)
+                if (!(announcementsBySubject.Count > 0))
                 {
                     var announcementsByPrice = announcementsBySubject.Where(m => m.Price <= price).ToList();

[Killed] Equality mutation
Services/AnnouncementManager.cs:45:82
                 var announcementsBySubject = announcementsByMeetingType.Where(m => m.Subject == subject).ToList();
                 if (announcementsBySubject.Count > 0)
                 {
-                    var announcementsByPrice = announcementsBySubject.Where(m => m.Price <= price).ToList();
+                    var announcementsByPrice = announcementsBySubject.Where(m => m.Price > price).ToList();
                     if (announcementsByPrice.Count > 0)
                     {

[Killed] Equality mutation
Services/AnnouncementManager.cs:45:82
                 var announcementsBySubject = announcementsByMeetingType.Where(m => m.Subject == subject).ToList();
                 if (announcementsBySubject.Count > 0)
                 {
-                    var announcementsByPrice = announcementsBySubject.Where(m => m.Price <= price).ToList();
+                    var announcementsByPrice = announcementsBySubject.Where(m => m.Price < price).ToList();
                     if (announcementsByPrice.Count > 0)
                     {

[Killed] Equality mutation
Services/AnnouncementManager.cs:46:25
                 if (announcementsBySubject.Count > 0)
                 {
                     var announcementsByPrice = announcementsBySubject.Where(m => m.Price <= price).ToList();
-                    if (announcementsByPrice.Count > 0)
+                    if (announcementsByPrice.Count < 0)
                     {
                         foreach (var mentor in announcementsByPrice)

[Killed] Negate expression
Services/AnnouncementManager.cs:46:25
                 if (announcementsBySubject.Count > 0)
                 {
                     var announcementsByPrice = announcementsBySubject.Where(m => m.Price <= price).ToList();
-                    if (announcementsByPrice.Count > 0)
+                    if (!(announcementsByPrice.Count > 0))
                     {
                         foreach (var mentor in announcementsByPrice)

[Survived] Equality mutation
Services/AnnouncementManager.cs:51:33
                         foreach (var mentor in announcementsByPrice)
                         {
                             var score = _announcementRepository.GetStudentStarsAverageRating(mentor.Id);
-                            if (stars <= score)
+                            if (stars > score)
                             {
                                 result.Add(announcementsByPrice.Where(m => m.Id == mentor.Id).First());

[Survived] Negate expression
Services/AnnouncementManager.cs:51:33
                         foreach (var mentor in announcementsByPrice)
                         {
                             var score = _announcementRepository.GetStudentStarsAverageRating(mentor.Id);
-                            if (stars <= score)
+                            if (!(stars <= score))
                             {
                                 result.Add(announcementsByPrice.Where(m => m.Id == mentor.Id).First());

[Killed] Equality mutation
Services/AnnouncementManager.cs:53:76
                             var score = _announcementRepository.GetStudentStarsAverageRating(mentor.Id);
                             if (stars <= score)
                             {
-                                result.Add(announcementsByPrice.Where(m => m.Id == mentor.Id).First());
+                                result.Add(announcementsByPrice.Where(m => m.Id != mentor.Id).First());
                             }
                         }

[Survived] Statement mutation
Services/AnnouncementManager.cs:53:33
                             var score = _announcementRepository.GetStudentStarsAverageRating(mentor.Id);
                             if (stars <= score)
                             {
-                                result.Add(announcementsByPrice.Where(m => m.Id == mentor.Id).First());
+                                ;
                             }
                         }

[Killed] Negate expression
Services/AnnouncementManager.cs:56:29
                                 result.Add(announcementsByPrice.Where(m => m.Id == mentor.Id).First());
                             }
                         }
-                        if (result.Count > 0)
+                        if (!(result.Count > 0))
                         {
                             return result;

[Killed] Equality mutation
Services/AnnouncementManager.cs:56:29
                                 result.Add(announcementsByPrice.Where(m => m.Id == mentor.Id).First());
                             }
                         }
-                        if (result.Count > 0)
+                        if (result.Count >= 0)
                         {
                             return result;

[Survived] Block removal mutation
Services/AnnouncementManager.cs:57:25
                             }
                         }
                         if (result.Count > 0)
-                        {
-                            return result;
-                        }
+                        {}
                         return announcementsByPrice;
                     }

[NoCoverage] Boolean mutation
Services/AnnouncementManager.cs:80:84
                 return uow.Announcements.Get()
                                             .Include(m => m.Mentor)
                                             .ThenInclude(m => m.User)
-                                            .Where(m => m.Mentor.User.IsDeleted == false)
+                                            .Where(m => m.Mentor.User.IsDeleted == true)
                                             .Select(m => new AllAnnouncementsDto
                                             {   Subject = m.Subject,

[NoCoverage] Equality mutation
Services/AnnouncementManager.cs:80:57
                 return uow.Announcements.Get()
                                             .Include(m => m.Mentor)
                                             .ThenInclude(m => m.User)
-                                            .Where(m => m.Mentor.User.IsDeleted == false)
+                                            .Where(m => m.Mentor.User.IsDeleted != false)
                                             .Select(m => new AllAnnouncementsDto
                                             {   Subject = m.Subject,

[NoCoverage] Object initializer mutation
Services/AnnouncementManager.cs:127:58
                                             .Include(m => m.Mentor)
                                             .ThenInclude(m => m.User)
                                             .Where(m => m.Mentor.User.Email.Equals(email))
-                                            .Select(m => new AllAnnouncementsDto
-                                            {
-                                                Id = m.Id,
-                                                Subject = m.Subject,
-                                                Description = m.Description,
-                                                Price = m.Price,
-                                                MeetingType = m.MeetingType,
-                                                Username = m.Mentor.User.Username,
-                                                Email = m.Mentor.User.Email,
-                                                PhoneNumber = m.Mentor.User.PhoneNumber
-
-                                            })
+                                            .Select(m => new AllAnnouncementsDto
+{})
                                             .ToList();
 

[NoCoverage] Logical mutation
Services/AnnouncementManager.cs:151:57
                 return uow.Announcements.Get()
                                             .Include(m => m.Mentor)
                                             .ThenInclude(m => m.User)
-                                            .Where(m => m.Mentor.User.IsDeleted == false && m.Subject.Equals(subject))
+                                            .Where(m => m.Mentor.User.IsDeleted == false || m.Subject.Equals(subject))
                                             .Select(m => new AllAnnouncementsDto
                                             {

[NoCoverage] Boolean mutation
Services/AnnouncementManager.cs:151:84
                 return uow.Announcements.Get()
                                             .Include(m => m.Mentor)
                                             .ThenInclude(m => m.User)
-                                            .Where(m => m.Mentor.User.IsDeleted == false && m.Subject.Equals(subject))
+                                            .Where(m => m.Mentor.User.IsDeleted == true && m.Subject.Equals(subject))
                                             .Select(m => new AllAnnouncementsDto
                                             {

[NoCoverage] Logical mutation
Services/AnnouncementManager.cs:174:57
                 return uow.Announcements.Get()
                                             .Include(m => m.Mentor)
                                             .ThenInclude(m => m.User)
-                                            .Where(m => m.Mentor.User.IsDeleted == false && m.Price <= price)
+                                            .Where(m => m.Mentor.User.IsDeleted == false || m.Price <= price)
                                             .Select(m => new AllAnnouncementsDto
                                             {

[NoCoverage] Equality mutation
Services/AnnouncementManager.cs:174:93
                 return uow.Announcements.Get()
                                             .Include(m => m.Mentor)
                                             .ThenInclude(m => m.User)
-                                            .Where(m => m.Mentor.User.IsDeleted == false && m.Price <= price)
+                                            .Where(m => m.Mentor.User.IsDeleted == false && m.Price < price)
                                             .Select(m => new AllAnnouncementsDto
                                             {

[NoCoverage] Object initializer mutation
Services/AnnouncementManager.cs:175:58
                                             .Include(m => m.Mentor)
                                             .ThenInclude(m => m.User)
                                             .Where(m => m.Mentor.User.IsDeleted == false && m.Price <= price)
-                                            .Select(m => new AllAnnouncementsDto
-                                            {
-                                                Subject = m.Subject,
-                                                Description = m.Description,
-                                                Price = m.Price,
-                                                MeetingType = m.MeetingType,
-                                                Username = m.Mentor.User.Username,
-                                                Email = m.Mentor.User.Email,
-                                                PhoneNumber = m.Mentor.User.PhoneNumber
-
-                                            })
+                                            .Select(m => new AllAnnouncementsDto
+{})
                                             .ToList();
 

[NoCoverage] Equality mutation
Services/AnnouncementManager.cs:197:57
                 return uow.Announcements.Get()
                                             .Include(m => m.Mentor)
                                             .ThenInclude(m => m.User)
-                                            .Where(m => m.Mentor.User.IsDeleted == false && m.MeetingType.Equals(meetingType))
+                                            .Where(m => m.Mentor.User.IsDeleted != false && m.MeetingType.Equals(meetingType))
                                             .Select(m => new AllAnnouncementsDto
                                             {

[NoCoverage] Boolean mutation
Services/AnnouncementManager.cs:197:84
                 return uow.Announcements.Get()
                                             .Include(m => m.Mentor)
                                             .ThenInclude(m => m.User)
-                                            .Where(m => m.Mentor.User.IsDeleted == false && m.MeetingType.Equals(meetingType))
+                                            .Where(m => m.Mentor.User.IsDeleted == true && m.MeetingType.Equals(meetingType))
                                             .Select(m => new AllAnnouncementsDto
                                             {

[NoCoverage] Statement mutation
Services/AnnouncementManager.cs:227:17
                 announcement.MentorId = uow.IdentityUsers.Get().First(f => f.Email.Equals(createAnnouncementDto.Email)).Id;
 
 
-                uow.Announcements.Insert(announcement);
+                ;
                 uow.SaveChanges();
                 return announcement;

[NoCoverage] Statement mutation
Services/AnnouncementManager.cs:228:17
 
 
                 uow.Announcements.Insert(announcement);
-                uow.SaveChanges();
+                ;
                 return announcement;
             });

[NoCoverage] Linq method mutation (SingleOrDefault() to Single())
Services/AnnouncementManager.cs:258:36
         {
             return ExecuteInTransaction(uow =>
             {
-                var announcement = uow.Announcements.Get()
-                                            .Include(m => m.Mentor)
-                                            .ThenInclude(m => m.User)
-                                            .Where(m => m.Mentor.User.IsDeleted == false && m.Id.Equals(id))
-                                            .SingleOrDefault();
+                var announcement = uow.Announcements.Get()
+                                            .Include(m => m.Mentor)
+                                            .ThenInclude(m => m.User)
+                                            .Where(m => m.Mentor.User.IsDeleted == false && m.Id.Equals(id))
+                                            .Single();
                 announcement.Description = updateAnnouncementDto.Description;
                 announcement.Subject = updateAnnouncementDto.Subject;

[NoCoverage] Equality mutation
Services/AnnouncementManager.cs:261:57
                 var announcement = uow.Announcements.Get()
                                             .Include(m => m.Mentor)
                                             .ThenInclude(m => m.User)
-                                            .Where(m => m.Mentor.User.IsDeleted == false && m.Id.Equals(id))
+                                            .Where(m => m.Mentor.User.IsDeleted != false && m.Id.Equals(id))
                                             .SingleOrDefault();
                 announcement.Description = updateAnnouncementDto.Description;

[NoCoverage] Logical mutation
Services/AnnouncementManager.cs:261:57
                 var announcement = uow.Announcements.Get()
                                             .Include(m => m.Mentor)
                                             .ThenInclude(m => m.User)
-                                            .Where(m => m.Mentor.User.IsDeleted == false && m.Id.Equals(id))
+                                            .Where(m => m.Mentor.User.IsDeleted == false || m.Id.Equals(id))
                                             .SingleOrDefault();
                 announcement.Description = updateAnnouncementDto.Description;

[NoCoverage] Statement mutation
Services/AnnouncementManager.cs:270:17
                 
                 
 
-                uow.Announcements.Update(announcement);
+                ;
                 uow.SaveChanges();
                 return true;

[NoCoverage] Statement mutation
Services/AnnouncementManager.cs:271:17
                 
 
                 uow.Announcements.Update(announcement);
-                uow.SaveChanges();
+                ;
                 return true;
             });

[NoCoverage] Boolean mutation
Services/AnnouncementManager.cs:272:24
 
                 uow.Announcements.Update(announcement);
                 uow.SaveChanges();
-                return true;
+                return false;
             });
         }

[NoCoverage] Linq method mutation (SingleOrDefault() to Single())
Services/AnnouncementManager.cs:279:36
         {
             return ExecuteInTransaction(uow =>
             {
-                var announcement = uow.Announcements.Get()
-                                            .Include(m => m.Mentor)
-                                            .ThenInclude(m => m.User)
-                                            .Where(m => m.Id.Equals(id))                                     
-                                            .SingleOrDefault();
+                var announcement = uow.Announcements.Get()
+                                            .Include(m => m.Mentor)
+                                            .ThenInclude(m => m.User)
+                                            .Where(m => m.Id.Equals(id))                                     
+                                            .Single();
                 if (announcement == null)
                 {

[NoCoverage] Equality mutation
Services/AnnouncementManager.cs:284:21
                                             .ThenInclude(m => m.User)
                                             .Where(m => m.Id.Equals(id))                                     
                                             .SingleOrDefault();
-                if (announcement == null)
+                if (announcement != null)
                 {
                     return false;

[NoCoverage] Statement mutation
Services/AnnouncementManager.cs:288:17
                 {
                     return false;
                 }
-                uow.Announcements.Delete(announcement);
+                ;
                 uow.SaveChanges();
                 return true;

[NoCoverage] Statement mutation
Services/AnnouncementManager.cs:289:17
                     return false;
                 }
                 uow.Announcements.Delete(announcement);
-                uow.SaveChanges();
+                ;
                 return true;
             });
