[Killed] Block removal mutation
Services/FilterMethodService.cs:19:9
         private readonly IUserManager _userAccountService;
         private readonly IAnnouncementRepository _announcementRepository;
         public FilterMethodService(ServiceDependencies serviceDependencies, IUserManager userAccountService, IAnnouncementRepository announcementRepository) : base(serviceDependencies)
-        {
-            _userAccountService = userAccountService;
-            _announcementRepository = announcementRepository;
-        }
+        {}
 
         public List<AllAnnouncementsDto>? GetAllAnnouncementByFilters(bool meetingType, string subject, int price, int stars)

[Killed] Equality mutation
Services/FilterMethodService.cs:30:17
             {
                 throw new Exception(ErrorMessages.SubjectNotValid);
             }
-            if (price <= 0)
+            if (price > 0)
             {
                 throw new Exception(ErrorMessages.PriceNotValid);

[Killed] Equality mutation
Services/FilterMethodService.cs:34:30
             {
                 throw new Exception(ErrorMessages.PriceNotValid);
             }
-            if (stars < 0 || stars > 5)
+            if (stars < 0 || stars >= 5)
             {
                 throw new Exception(ErrorMessages.StarsNotValid);

[NoCoverage] Equality mutation
Services/FilterMethodService.cs:53:33
                         foreach (var mentor in announcementsByPrice)
                         {
                             var score = _announcementRepository.GetStudentStarsAverageRating(mentor.Id);
-                            if (stars <= score)
+                            if (stars < score)
                             {
                                 result.Add(announcementsByPrice.Where(m => m.Id == mentor.Id).First());

[NoCoverage] Linq method mutation (First() to FirstOrDefault())
Services/FilterMethodService.cs:55:44
                             var score = _announcementRepository.GetStudentStarsAverageRating(mentor.Id);
                             if (stars <= score)
                             {
-                                result.Add(announcementsByPrice.Where(m => m.Id == mentor.Id).First());
+                                result.Add(announcementsByPrice.Where(m => m.Id == mentor.Id).FirstOrDefault());
                             }
                         }

[Killed] Logical mutation
Services/FilterMethodService.cs:82:17
             {
                 throw new Exception(ErrorMessages.PriceNotValid);
             }
-            if (stars < 0 && stars > 5)
+            if (stars < 0 || stars > 5)
             {
                 throw new Exception(ErrorMessages.StarsNotValid);

[Killed] Equality mutation
Services/FilterMethodService.cs:82:30
             {
                 throw new Exception(ErrorMessages.PriceNotValid);
             }
-            if (stars < 0 && stars > 5)
+            if (stars < 0 && stars >= 5)
             {
                 throw new Exception(ErrorMessages.StarsNotValid);

[Killed] Equality mutation
Services/FilterMethodService.cs:89:17
 
             var announcementsByMeetingType =
                 _announcementRepository.GetAllAnnouncementByMeetingType(meetingType);
-            if (announcementsByMeetingType.Count > 0)
+            if (announcementsByMeetingType.Count < 0)
             {
                 var result = new List<AllAnnouncementsDto>();

[Killed] Equality mutation
Services/FilterMethodService.cs:129:17
             {
                 throw new Exception(ErrorMessages.PriceNotValid);
             }
-            if (stars < 0 || stars > 5)
+            if (stars > 0 || stars > 5)
 
             {

[Killed] Equality mutation
Services/FilterMethodService.cs:129:17
             {
                 throw new Exception(ErrorMessages.PriceNotValid);
             }
-            if (stars < 0 || stars > 5)
+            if (stars <= 0 || stars > 5)
 
             {

[Timeout] Negate expression
Services/FilterMethodService.cs:137:17
 
             var announcementsByMeetingType =
                 _announcementRepository.GetAllAnnouncementByMeetingType(meetingType);
-            if (announcementsByMeetingType.Count >= 0)
+            if (!(announcementsByMeetingType.Count >= 0))
             {
                 var result = new List<AllAnnouncementsDto>();

[Timeout] Equality mutation
Services/FilterMethodService.cs:137:17
 
             var announcementsByMeetingType =
                 _announcementRepository.GetAllAnnouncementByMeetingType(meetingType);
-            if (announcementsByMeetingType.Count >= 0)
+            if (announcementsByMeetingType.Count < 0)
             {
                 var result = new List<AllAnnouncementsDto>();

[Timeout] Equality mutation
Services/FilterMethodService.cs:141:21
             {
                 var result = new List<AllAnnouncementsDto>();
                 var announcementsBySubject = announcementsByMeetingType.Where(m => m.Subject == subject).ToList();
-                if (announcementsBySubject.Count > 0)
+                if (announcementsBySubject.Count >= 0)
                 {
                     var announcementsByPrice = announcementsBySubject.Where(m => m.Price <= price).ToList();

[NoCoverage] Equality mutation
Services/FilterMethodService.cs:154:29
                                 result.Add(announcementsByPrice.Where(m => m.Id == mentor.Id).First());
                             }
                         }
-                        if (result.Count > 0)
+                        if (result.Count < 0)
                         {
                             return result;

[Killed] Equality mutation
Services/FilterMethodService.cs:184:17
 
             var announcementsByMeetingType =
                 _announcementRepository.GetAllAnnouncementByMeetingType(meetingType);
-            if (announcementsByMeetingType.Count <= 0)
+            if (announcementsByMeetingType.Count < 0)
             {
                 var result = new List<AllAnnouncementsDto>();

[Killed] Negate expression
Services/FilterMethodService.cs:184:17
 
             var announcementsByMeetingType =
                 _announcementRepository.GetAllAnnouncementByMeetingType(meetingType);
-            if (announcementsByMeetingType.Count <= 0)
+            if (!(announcementsByMeetingType.Count <= 0))
             {
                 var result = new List<AllAnnouncementsDto>();

[NoCoverage] Equality mutation
Services/FilterMethodService.cs:191:25
                 if (announcementsBySubject.Count > 0)
                 {
                     var announcementsByPrice = announcementsBySubject.Where(m => m.Price <= price).ToList();
-                    if (announcementsByPrice.Count > 0)
+                    if (announcementsByPrice.Count >= 0)
                     {
                         foreach (var mentor in announcementsByPrice)

[Killed] Equality mutation
Services/FilterMethodService.cs:235:21
             {
                 var result = new List<AllAnnouncementsDto>();
                 var announcementsBySubject = announcementsByMeetingType.Where(m => m.Subject == subject).ToList();
-                if (announcementsBySubject.Count >= 0)
+                if (announcementsBySubject.Count > 0)
                 {
                     var announcementsByPrice = announcementsBySubject.Where(m => m.Price <= price).ToList();

[Killed] Equality mutation
Services/FilterMethodService.cs:235:21
             {
                 var result = new List<AllAnnouncementsDto>();
                 var announcementsBySubject = announcementsByMeetingType.Where(m => m.Subject == subject).ToList();
-                if (announcementsBySubject.Count >= 0)
+                if (announcementsBySubject.Count < 0)
                 {
                     var announcementsByPrice = announcementsBySubject.Where(m => m.Price <= price).ToList();

[Killed] Equality mutation
Services/FilterMethodService.cs:282:21
             {
                 var result = new List<AllAnnouncementsDto>();
                 var announcementsBySubject = announcementsByMeetingType.Where(m => m.Subject == subject).ToList();
-                if (announcementsBySubject.Count != 0)
+                if (announcementsBySubject.Count == 0)
                 {
                     var announcementsByPrice = announcementsBySubject.Where(m => m.Price <= price).ToList();

[Killed] Negate expression
Services/FilterMethodService.cs:332:25
                 if (announcementsBySubject.Count > 0)
                 {
                     var announcementsByPrice = announcementsBySubject.Where(m => m.Price <= price).ToList();
-                    if (announcementsByPrice.Count >= 0)
+                    if (!(announcementsByPrice.Count >= 0))
                     {
                         foreach (var mentor in announcementsByPrice)

[Killed] Equality mutation
Services/FilterMethodService.cs:332:25
                 if (announcementsBySubject.Count > 0)
                 {
                     var announcementsByPrice = announcementsBySubject.Where(m => m.Price <= price).ToList();
-                    if (announcementsByPrice.Count >= 0)
+                    if (announcementsByPrice.Count < 0)
                     {
                         foreach (var mentor in announcementsByPrice)

[NoCoverage] Equality mutation
Services/FilterMethodService.cs:384:33
                         foreach (var mentor in announcementsByPrice)
                         {
                             var score = _announcementRepository.GetStudentStarsAverageRating(mentor.Id);
-                            if (stars < score)
+                            if (stars <= score)
 
                             {

[NoCoverage] Equality mutation
Services/FilterMethodService.cs:384:33
                         foreach (var mentor in announcementsByPrice)
                         {
                             var score = _announcementRepository.GetStudentStarsAverageRating(mentor.Id);
-                            if (stars < score)
+                            if (stars > score)
 
                             {

[NoCoverage] Equality mutation
Services/FilterMethodService.cs:437:29
                                 result.Add(announcementsByPrice.Where(m => m.Id == mentor.Id).First());
                             }
                         }
-                        if (result.Count == 0)
+                        if (result.Count != 0)
                         {
                             return result;

[NoCoverage] Block removal mutation
Services/FilterMethodService.cs:438:25
                             }
                         }
                         if (result.Count == 0)
-                        {
-                            return result;
-                        }
+                        {}
                         return announcementsByPrice;
                     }

[Killed] Negate expression
Services/FilterMethodService.cs:460:17
             {
                 throw new Exception(ErrorMessages.PriceNotValid);
             }
-            if (stars < 0 || stars > 5)
+            if (!(stars < 0 || stars > 5))
             {
                 throw new Exception(ErrorMessages.StarsNotValid);

[NoCoverage] Negate expression
Services/FilterMethodService.cs:484:29
                                 result.Add(announcementsByPrice.Where(m => m.Id == mentor.Id).First());
                             }
                         }
-                        if (result.Count >= 0)
+                        if (!(result.Count >= 0))
                         {
                             return result;

[NoCoverage] Equality mutation
Services/FilterMethodService.cs:484:29
                                 result.Add(announcementsByPrice.Where(m => m.Id == mentor.Id).First());
                             }
                         }
-                        if (result.Count >= 0)
+                        if (result.Count < 0)
                         {
                             return result;

[NoCoverage] Block removal mutation
Services/FilterMethodService.cs:485:25
                             }
                         }
                         if (result.Count >= 0)
-                        {
-                            return result;
-                        }
+                        {}
                         return announcementsByPrice;
                     }
