[Killed] Block removal mutation
Services/MatchingService.cs:20:9
 
         public MatchingService(ServiceDependencies dependencies, IMatchingRepository matchingRepository, IUserRepository userRepository, IAnnouncementRepository announcementRepository) 
             : base(dependencies)
-        {
-            _matchingRepository = matchingRepository;
-            _userRepository = userRepository;
-            _announcementRepository = announcementRepository;
-        }
+        {}
 
         public bool NewMatching(Guid mentorId, Guid studentId, string subject)

[NoCoverage] Negate expression
Services/MatchingService.cs:28:17
 
         public bool NewMatching(Guid mentorId, Guid studentId, string subject)
         {
-            if (Enum.TryParse(subject, true, out Subjects _))
+            if (!(Enum.TryParse(subject, true, out Subjects _)))
             {
                try

[NoCoverage] Boolean mutation
Services/MatchingService.cs:28:40
 
         public bool NewMatching(Guid mentorId, Guid studentId, string subject)
         {
-            if (Enum.TryParse(subject, true, out Subjects _))
+            if (Enum.TryParse(subject, false, out Subjects _))
             {
                try

[NoCoverage] Statement mutation
Services/MatchingService.cs:38:20
                    match.Status = StatusMatch.Waiting.ToString();
                    match.AnnouncementId = _announcementRepository.GetAnnouncementIdBySubjectAndMentorId(subject, mentorId);
                    match.MatchDate = DateTime.Now;
-                   _matchingRepository.InsertMatch(match);
+                   ;
                    Console.WriteLine("Operations completed successfully.");
                    return true;

[NoCoverage] Statement mutation
Services/MatchingService.cs:39:20
                    match.AnnouncementId = _announcementRepository.GetAnnouncementIdBySubjectAndMentorId(subject, mentorId);
                    match.MatchDate = DateTime.Now;
                    _matchingRepository.InsertMatch(match);
-                   Console.WriteLine("Operations completed successfully.");
+                   ;
                    return true;
                }

[NoCoverage] Boolean mutation
Services/MatchingService.cs:40:27
                    match.MatchDate = DateTime.Now;
                    _matchingRepository.InsertMatch(match);
                    Console.WriteLine("Operations completed successfully.");
-                   return true;
+                   return false;
                }
                catch (Exception ex)

[NoCoverage] Statement mutation
Services/MatchingService.cs:44:20
                }
                catch (Exception ex)
                {
-                   Console.WriteLine("An error occurred: " + ex.Message);
+                   ;
                    return false;
                }

[NoCoverage] Boolean mutation
Services/MatchingService.cs:45:27
                catch (Exception ex)
                {
                    Console.WriteLine("An error occurred: " + ex.Message);
-                   return false;
+                   return true;
                }
             }

[NoCoverage] Logical mutation
Services/MatchingService.cs:63:47
             {
                 return uow.Matches.Get()
                                   .Include(s => s.Mentor)
-                                  .Where(x => x.StudentId == studentId && x.Status.Equals(StatusMatch.Accepted.ToString()))
+                                  .Where(x => x.StudentId == studentId || x.Status.Equals(StatusMatch.Accepted.ToString()))
                                   .Select(x => new ViewStudentMatchDTO
                                   {

[NoCoverage] Equality mutation
Services/MatchingService.cs:63:47
             {
                 return uow.Matches.Get()
                                   .Include(s => s.Mentor)
-                                  .Where(x => x.StudentId == studentId && x.Status.Equals(StatusMatch.Accepted.ToString()))
+                                  .Where(x => x.StudentId != studentId && x.Status.Equals(StatusMatch.Accepted.ToString()))
                                   .Select(x => new ViewStudentMatchDTO
                                   {

[NoCoverage] Linq method mutation (Single() to SingleOrDefault())
Services/MatchingService.cs:66:50
                                   .Where(x => x.StudentId == studentId && x.Status.Equals(StatusMatch.Accepted.ToString()))
                                   .Select(x => new ViewStudentMatchDTO
                                   {
-                                      FullName = uow.IdentityUsers.Get()
-                                                         .Where(u => u.Id.Equals(x.Mentor.Id))
-                                                         .Select(u => u.Username)
-                                                         .Single(),
+                                      FullName = uow.IdentityUsers.Get()
+                                                         .Where(u => u.Id.Equals(x.Mentor.Id))
+                                                         .Select(u => u.Username)
+                                                         .SingleOrDefault(),
                                       Email = uow.IdentityUsers.Get()
                                                          .Where(u => u.Id.Equals(x.Mentor.Id))

[NoCoverage] Linq method mutation (Single() to SingleOrDefault())
Services/MatchingService.cs:70:47
                                                          .Where(u => u.Id.Equals(x.Mentor.Id))
                                                          .Select(u => u.Username)
                                                          .Single(),
-                                      Email = uow.IdentityUsers.Get()
-                                                         .Where(u => u.Id.Equals(x.Mentor.Id))
-                                                         .Select(u => u.Email)
-                                                         .Single(),
+                                      Email = uow.IdentityUsers.Get()
+                                                         .Where(u => u.Id.Equals(x.Mentor.Id))
+                                                         .Select(u => u.Email)
+                                                         .SingleOrDefault(),
                                       MatchDate = x.MatchDate,
                                       Status = x.Status,

[NoCoverage] Linq method mutation (Single() to SingleOrDefault())
Services/MatchingService.cs:76:49
                                                          .Single(),
                                       MatchDate = x.MatchDate,
                                       Status = x.Status,
-                                      Subject = uow.Announcements.Get().Where(s => s.MentorId.Equals(x.MentorId)).Select(s => s.Subject).Single(),
+                                      Subject = uow.Announcements.Get().Where(s => s.MentorId.Equals(x.MentorId)).Select(s => s.Subject).SingleOrDefault(),
                                       Price = uow.Announcements.Get().Where(s => s.MentorId.Equals(x.MentorId)).Select(s => s.Price).Single(),
                                   }).ToList();

[NoCoverage] Linq method mutation (Single() to SingleOrDefault())
Services/MatchingService.cs:77:47
                                       MatchDate = x.MatchDate,
                                       Status = x.Status,
                                       Subject = uow.Announcements.Get().Where(s => s.MentorId.Equals(x.MentorId)).Select(s => s.Subject).Single(),
-                                      Price = uow.Announcements.Get().Where(s => s.MentorId.Equals(x.MentorId)).Select(s => s.Price).Single(),
+                                      Price = uow.Announcements.Get().Where(s => s.MentorId.Equals(x.MentorId)).Select(s => s.Price).SingleOrDefault(),
                                   }).ToList();
             });

[NoCoverage] Equality mutation
Services/MatchingService.cs:88:47
             {
                 return uow.Matches.Get()
                                   .Include(s => s.Mentor)
-                                  .Where(x => x.StudentId == studentId && x.Status.Equals(StatusMatch.Rejected.ToString()))
+                                  .Where(x => x.StudentId != studentId && x.Status.Equals(StatusMatch.Rejected.ToString()))
                                   .Select(x => new ViewStudentMatchDTO
                                   {

[NoCoverage] Logical mutation
Services/MatchingService.cs:88:47
             {
                 return uow.Matches.Get()
                                   .Include(s => s.Mentor)
-                                  .Where(x => x.StudentId == studentId && x.Status.Equals(StatusMatch.Rejected.ToString()))
+                                  .Where(x => x.StudentId == studentId || x.Status.Equals(StatusMatch.Rejected.ToString()))
                                   .Select(x => new ViewStudentMatchDTO
                                   {

[NoCoverage] Equality mutation
Services/MatchingService.cs:113:47
             {
                 return uow.Matches.Get()
                                   .Include(s => s.Mentor)
-                                  .Where(x => x.StudentId == studentId && x.Status.Equals(StatusMatch.Waiting.ToString()))
+                                  .Where(x => x.StudentId != studentId && x.Status.Equals(StatusMatch.Waiting.ToString()))
                                   .Select(x => new ViewStudentMatchDTO
                                   {

[NoCoverage] Logical mutation
Services/MatchingService.cs:113:47
             {
                 return uow.Matches.Get()
                                   .Include(s => s.Mentor)
-                                  .Where(x => x.StudentId == studentId && x.Status.Equals(StatusMatch.Waiting.ToString()))
+                                  .Where(x => x.StudentId == studentId || x.Status.Equals(StatusMatch.Waiting.ToString()))
                                   .Select(x => new ViewStudentMatchDTO
                                   {

[NoCoverage] Equality mutation
Services/MatchingService.cs:139:47
             {
                 return uow.Matches.Get()
                                   .Include(s => s.Student)
-                                  .Where(x => x.MentorId == mentorId)
+                                  .Where(x => x.MentorId != mentorId)
                                   .Select(x => new ViewMentorMatchDTO
                                   {

[NoCoverage] Object initializer mutation
Services/MatchingService.cs:140:48
                 return uow.Matches.Get()
                                   .Include(s => s.Student)
                                   .Where(x => x.MentorId == mentorId)
-                                  .Select(x => new ViewMentorMatchDTO
-                                  {
-                                      FullName = uow.IdentityUsers.Get()
-                                                         .Where(u => u.Id.Equals(x.Student.Id))
-                                                         .Select(u => u.Username)
-                                                         .Single(),
-                                      Email = uow.IdentityUsers.Get()
-                                                         .Where(u => u.Id.Equals(x.Student.Id))
-                                                         .Select(u => u.Email)
-                                                         .Single(),
-                                      MatchDate = x.MatchDate,
-                                      Status = x.Status,
-
-                                  }).ToList();
+                                  .Select(x => new ViewMentorMatchDTO
+{}).ToList();
             });
         }

[NoCoverage] Linq method mutation (Single() to SingleOrDefault())
Services/MatchingService.cs:142:50
                                   .Where(x => x.MentorId == mentorId)
                                   .Select(x => new ViewMentorMatchDTO
                                   {
-                                      FullName = uow.IdentityUsers.Get()
-                                                         .Where(u => u.Id.Equals(x.Student.Id))
-                                                         .Select(u => u.Username)
-                                                         .Single(),
+                                      FullName = uow.IdentityUsers.Get()
+                                                         .Where(u => u.Id.Equals(x.Student.Id))
+                                                         .Select(u => u.Username)
+                                                         .SingleOrDefault(),
                                       Email = uow.IdentityUsers.Get()
                                                          .Where(u => u.Id.Equals(x.Student.Id))

[NoCoverage] Linq method mutation (Single() to SingleOrDefault())
Services/MatchingService.cs:146:47
                                                          .Where(u => u.Id.Equals(x.Student.Id))
                                                          .Select(u => u.Username)
                                                          .Single(),
-                                      Email = uow.IdentityUsers.Get()
-                                                         .Where(u => u.Id.Equals(x.Student.Id))
-                                                         .Select(u => u.Email)
-                                                         .Single(),
+                                      Email = uow.IdentityUsers.Get()
+                                                         .Where(u => u.Id.Equals(x.Student.Id))
+                                                         .Select(u => u.Email)
+                                                         .SingleOrDefault(),
                                       MatchDate = x.MatchDate,
                                       Status = x.Status,

[NoCoverage] Logical mutation
Services/MatchingService.cs:163:47
             {
                 return uow.Matches.Get()
                                   .Include(s => s.Student)
-                                  .Where(x => x.MentorId == mentorId && x.Status.Equals(StatusMatch.Accepted.ToString()))
+                                  .Where(x => x.MentorId == mentorId || x.Status.Equals(StatusMatch.Accepted.ToString()))
                                   .Select(x => new ViewMentorMatchDTO
                                   {

[NoCoverage] Equality mutation
Services/MatchingService.cs:163:47
             {
                 return uow.Matches.Get()
                                   .Include(s => s.Student)
-                                  .Where(x => x.MentorId == mentorId && x.Status.Equals(StatusMatch.Accepted.ToString()))
+                                  .Where(x => x.MentorId != mentorId && x.Status.Equals(StatusMatch.Accepted.ToString()))
                                   .Select(x => new ViewMentorMatchDTO
                                   {

[NoCoverage] Object initializer mutation
Services/MatchingService.cs:164:48
                 return uow.Matches.Get()
                                   .Include(s => s.Student)
                                   .Where(x => x.MentorId == mentorId && x.Status.Equals(StatusMatch.Accepted.ToString()))
-                                  .Select(x => new ViewMentorMatchDTO
-                                  {
-                                      FullName = uow.IdentityUsers.Get()
-                                                         .Where(u => u.Id.Equals(x.Student.Id))
-                                                         .Select(u => u.Username)
-                                                         .Single(),
-                                      Email = uow.IdentityUsers.Get()
-                                                         .Where(u => u.Id.Equals(x.Student.Id))
-                                                         .Select(u => u.Email)
-                                                         .Single(),
-                                      MatchDate = x.MatchDate,
-                                      Status = x.Status,
-                                                                        
-                                  }).ToList();
+                                  .Select(x => new ViewMentorMatchDTO
+{}).ToList();
             });
         }

[NoCoverage] Equality mutation
Services/MatchingService.cs:185:65
         {
             return ExecuteInTransaction(uow =>
             {
-                var userId = uow.IdentityUsers.Get().Where(s => s.Email == email).Select(s => s.Id).Single();
+                var userId = uow.IdentityUsers.Get().Where(s => s.Email != email).Select(s => s.Id).Single();
                 return uow.Matches.Get()
                                   .Include(s => s.Student)

[NoCoverage] Linq method mutation (Single() to SingleOrDefault())
Services/MatchingService.cs:185:30
         {
             return ExecuteInTransaction(uow =>
             {
-                var userId = uow.IdentityUsers.Get().Where(s => s.Email == email).Select(s => s.Id).Single();
+                var userId = uow.IdentityUsers.Get().Where(s => s.Email == email).Select(s => s.Id).SingleOrDefault();
                 return uow.Matches.Get()
                                   .Include(s => s.Student)

[NoCoverage] Equality mutation
Services/MatchingService.cs:188:47
                 var userId = uow.IdentityUsers.Get().Where(s => s.Email == email).Select(s => s.Id).Single();
                 return uow.Matches.Get()
                                   .Include(s => s.Student)
-                                  .Where(x => x.MentorId == userId && x.Status.Equals(StatusMatch.Rejected.ToString()))
+                                  .Where(x => x.MentorId != userId && x.Status.Equals(StatusMatch.Rejected.ToString()))
                                   .Select(x => new ViewMentorMatchDTO
                                   {

[NoCoverage] Logical mutation
Services/MatchingService.cs:188:47
                 var userId = uow.IdentityUsers.Get().Where(s => s.Email == email).Select(s => s.Id).Single();
                 return uow.Matches.Get()
                                   .Include(s => s.Student)
-                                  .Where(x => x.MentorId == userId && x.Status.Equals(StatusMatch.Rejected.ToString()))
+                                  .Where(x => x.MentorId == userId || x.Status.Equals(StatusMatch.Rejected.ToString()))
                                   .Select(x => new ViewMentorMatchDTO
                                   {

[NoCoverage] Equality mutation
Services/MatchingService.cs:214:48
 
                 return uow.Matches.Get()
                                    .Include(s => s.Student)
-                                   .Where(x => x.MentorId == userId && x.Status.Equals(StatusMatch.Waiting.ToString()))
+                                   .Where(x => x.MentorId != userId && x.Status.Equals(StatusMatch.Waiting.ToString()))
                                    .Select(x => new ViewMentorMatchDTO
                                    {

[NoCoverage] Logical mutation
Services/MatchingService.cs:214:48
 
                 return uow.Matches.Get()
                                    .Include(s => s.Student)
-                                   .Where(x => x.MentorId == userId && x.Status.Equals(StatusMatch.Waiting.ToString()))
+                                   .Where(x => x.MentorId == userId || x.Status.Equals(StatusMatch.Waiting.ToString()))
                                    .Select(x => new ViewMentorMatchDTO
                                    {

[NoCoverage] Object initializer mutation
Services/MatchingService.cs:215:49
                 return uow.Matches.Get()
                                    .Include(s => s.Student)
                                    .Where(x => x.MentorId == userId && x.Status.Equals(StatusMatch.Waiting.ToString()))
-                                   .Select(x => new ViewMentorMatchDTO
-                                   {
-                                       FullName = uow.IdentityUsers.Get()
-                                                          .Where(u => u.Id.Equals(x.Student.Id))
-                                                          .Select(u => u.Username)
-                                                          .Single(),
-                                       Email = uow.IdentityUsers.Get()
-                                                          .Where(u => u.Id.Equals(x.Student.Id))
-                                                          .Select(u => u.Email)
-                                                          .Single(),
-                                       MatchDate = x.MatchDate,
-                                       Status = x.Status,
-                                       subject = uow.Announcements.Get().Where(s => s.MentorId.Equals(userId)).Select(s => s.Subject).First()
-
-
-                                   }).ToList();
+                                   .Select(x => new ViewMentorMatchDTO
+{}).ToList();
             });
         }

[NoCoverage] Linq method mutation (First() to FirstOrDefault())
Services/MatchingService.cs:227:50
                                                           .Single(),
                                        MatchDate = x.MatchDate,
                                        Status = x.Status,
-                                       subject = uow.Announcements.Get().Where(s => s.MentorId.Equals(userId)).Select(s => s.Subject).First()
+                                       subject = uow.Announcements.Get().Where(s => s.MentorId.Equals(userId)).Select(s => s.Subject).FirstOrDefault()
 
 

[Killed] Equality mutation
Services/MatchingService.cs:246:17
                 _matchingRepository.GetMatchByStudentIdAndMentorIdAndAnnouncementId(studentId, mentorId,
                     announcementId);
             
-            if (request == null)
+            if (request != null)
             {
                 return false;

[Killed] Negate expression
Services/MatchingService.cs:251:17
                 return false;
             }
 
-            if (response)
+            if (!(response))
             {
                 request.Status = StatusMatch.Accepted.ToString();

[Killed] Block removal mutation
Services/MatchingService.cs:252:13
             }
 
             if (response)
-            {
-                request.Status = StatusMatch.Accepted.ToString();
-
-            }
+            {}
             else
             {

[Killed] Block removal mutation
Services/MatchingService.cs:257:13
 
             }
             else
-            {
-                request.Status = StatusMatch.Rejected.ToString();
-            }
+            {}
 
             _matchingRepository.UpdateMatch(request);

[Survived] Statement mutation
Services/MatchingService.cs:261:13
                 request.Status = StatusMatch.Rejected.ToString();
             }
 
-            _matchingRepository.UpdateMatch(request);
+            ;
             return true;
             

[Killed] Boolean mutation
Services/MatchingService.cs:262:20
             }
 
             _matchingRepository.UpdateMatch(request);
-            return true;
+            return false;
             
         }

[NoCoverage] Logical mutation
Services/MatchingService.cs:271:73
         {
             return ExecuteInTransaction(uow =>
             {
-                var announcementId = uow.Announcements.Get().Where(s => s.Subject.Equals(subject) && s.MentorId.Equals(mentorId)).Select(s => s.Id).FirstOrDefault();
+                var announcementId = uow.Announcements.Get().Where(s => s.Subject.Equals(subject) || s.MentorId.Equals(mentorId)).Select(s => s.Id).FirstOrDefault();
                 var request = uow.Matches.Get()
                                             .Where(x => x.StudentId == studentId && x.MentorId == mentorId && x.AnnouncementId.Equals(announcementId))

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
Services/MatchingService.cs:271:38
         {
             return ExecuteInTransaction(uow =>
             {
-                var announcementId = uow.Announcements.Get().Where(s => s.Subject.Equals(subject) && s.MentorId.Equals(mentorId)).Select(s => s.Id).FirstOrDefault();
+                var announcementId = uow.Announcements.Get().Where(s => s.Subject.Equals(subject) && s.MentorId.Equals(mentorId)).Select(s => s.Id).First();
                 var request = uow.Matches.Get()
                                             .Where(x => x.StudentId == studentId && x.MentorId == mentorId && x.AnnouncementId.Equals(announcementId))

[NoCoverage] Linq method mutation (SingleOrDefault() to Single())
Services/MatchingService.cs:272:31
             return ExecuteInTransaction(uow =>
             {
                 var announcementId = uow.Announcements.Get().Where(s => s.Subject.Equals(subject) && s.MentorId.Equals(mentorId)).Select(s => s.Id).FirstOrDefault();
-                var request = uow.Matches.Get()
-                                            .Where(x => x.StudentId == studentId && x.MentorId == mentorId && x.AnnouncementId.Equals(announcementId))
-                                            .SingleOrDefault();
+                var request = uow.Matches.Get()
+                                            .Where(x => x.StudentId == studentId && x.MentorId == mentorId && x.AnnouncementId.Equals(announcementId))
+                                            .Single();
                 if (request == null)
                 {

[NoCoverage] Equality mutation
Services/MatchingService.cs:273:57
             {
                 var announcementId = uow.Announcements.Get().Where(s => s.Subject.Equals(subject) && s.MentorId.Equals(mentorId)).Select(s => s.Id).FirstOrDefault();
                 var request = uow.Matches.Get()
-                                            .Where(x => x.StudentId == studentId && x.MentorId == mentorId && x.AnnouncementId.Equals(announcementId))
+                                            .Where(x => x.StudentId != studentId && x.MentorId == mentorId && x.AnnouncementId.Equals(announcementId))
                                             .SingleOrDefault();
                 if (request == null)

[NoCoverage] Equality mutation
Services/MatchingService.cs:273:85
             {
                 var announcementId = uow.Announcements.Get().Where(s => s.Subject.Equals(subject) && s.MentorId.Equals(mentorId)).Select(s => s.Id).FirstOrDefault();
                 var request = uow.Matches.Get()
-                                            .Where(x => x.StudentId == studentId && x.MentorId == mentorId && x.AnnouncementId.Equals(announcementId))
+                                            .Where(x => x.StudentId == studentId && x.MentorId != mentorId && x.AnnouncementId.Equals(announcementId))
                                             .SingleOrDefault();
                 if (request == null)

[NoCoverage] Equality mutation
Services/MatchingService.cs:275:21
                 var request = uow.Matches.Get()
                                             .Where(x => x.StudentId == studentId && x.MentorId == mentorId && x.AnnouncementId.Equals(announcementId))
                                             .SingleOrDefault();
-                if (request == null)
+                if (request != null)
                 {
                     return false;

[NoCoverage] Statement mutation
Services/MatchingService.cs:281:17
                 }
 
 
-                uow.SaveChanges();
+                ;
                 return true;
             });
