[NoCoverage] Boolean mutation
Services/MentorManager.cs:30:81
                 return uow.Mentors.Get()
                                             .Include(m => m.User)
                                             .ThenInclude(r => r.Role)
-                                            .Where(m => m.User.IsDeleted.Equals(false))
+                                            .Where(m => m.User.IsDeleted.Equals(true))
                                             .Select(m => new AllMentorsDto
                                             {

[NoCoverage] Linq method mutation (Single() to SingleOrDefault())
Services/MentorManager.cs:45:60
                                                 //  IsDeleted = m.User.IsDeleted,
                                                 Bio = m.User.Bio,
                                                 EducationalInstitution = m.User.EducationalInstitution,
-                                                RoleName = uow.IdentityRoles.Get().Where(r => r.Id.Equals(m.User.RoleId)).Select(r => r.Name).Single(),
+                                                RoleName = uow.IdentityRoles.Get().Where(r => r.Id.Equals(m.User.RoleId)).Select(r => r.Name).SingleOrDefault(),
                                                 City = m.User.Adress.City,
                                                 County = m.User.Adress.County,

[NoCoverage] Equality mutation
Services/MentorManager.cs:49:95
                                                 City = m.User.Adress.City,
                                                 County = m.User.Adress.County,
                                                 AddressInfo = m.User.Adress.AddressInfo,
-                                                Subject = uow.Announcements.Get().Where(an => an.MentorId == m.Id).Select(s => s.Subject).ToList(),
+                                                Subject = uow.Announcements.Get().Where(an => an.MentorId != m.Id).Select(s => s.Subject).ToList(),
                                                 Price = uow.Announcements.Get().Where(an => an.MentorId == m.Id).Select(s => s.Price).ToList(),
                                                 // Subject = uow.Announcements.Get().FirstOrDefault(an => an.MentorId == m.Id).Subject, changed because a mentor can have more courses

[NoCoverage] Equality mutation
Services/MentorManager.cs:50:93
                                                 County = m.User.Adress.County,
                                                 AddressInfo = m.User.Adress.AddressInfo,
                                                 Subject = uow.Announcements.Get().Where(an => an.MentorId == m.Id).Select(s => s.Subject).ToList(),
-                                                Price = uow.Announcements.Get().Where(an => an.MentorId == m.Id).Select(s => s.Price).ToList(),
+                                                Price = uow.Announcements.Get().Where(an => an.MentorId != m.Id).Select(s => s.Price).ToList(),
                                                 // Subject = uow.Announcements.Get().FirstOrDefault(an => an.MentorId == m.Id).Subject, changed because a mentor can have more courses
                                             }) 

[NoCoverage] Logical mutation
Services/MentorManager.cs:65:53
                 return uow.Mentors.Get()
                                         .Include(m => m.User)
                                         .ThenInclude(r => r.Role)
-                                        .Where(m => m.Id.Equals(mentorId) && m.User.IsDeleted.Equals(false))
+                                        .Where(m => m.Id.Equals(mentorId) || m.User.IsDeleted.Equals(false))
                                         .Select(m => new MentorByIdViewByMentorAdminDTO
                                         {

[NoCoverage] Boolean mutation
Services/MentorManager.cs:65:102
                 return uow.Mentors.Get()
                                         .Include(m => m.User)
                                         .ThenInclude(r => r.Role)
-                                        .Where(m => m.Id.Equals(mentorId) && m.User.IsDeleted.Equals(false))
+                                        .Where(m => m.Id.Equals(mentorId) && m.User.IsDeleted.Equals(true))
                                         .Select(m => new MentorByIdViewByMentorAdminDTO
                                         {

[NoCoverage] Logical mutation
Services/MentorManager.cs:93:53
             {
                 return uow.Mentors.Get()
                                         .Include(m => m.User)                     
-                                        .Where(m => m.Id.Equals(mentorId) && m.User.IsDeleted.Equals(false))
+                                        .Where(m => m.Id.Equals(mentorId) || m.User.IsDeleted.Equals(false))
                                         .Select(m => new MentorByIdViewByStudentDTO
                                         {

[NoCoverage] Boolean mutation
Services/MentorManager.cs:93:102
             {
                 return uow.Mentors.Get()
                                         .Include(m => m.User)                     
-                                        .Where(m => m.Id.Equals(mentorId) && m.User.IsDeleted.Equals(false))
+                                        .Where(m => m.Id.Equals(mentorId) && m.User.IsDeleted.Equals(true))
                                         .Select(m => new MentorByIdViewByStudentDTO
                                         {

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
Services/MentorManager.cs:110:35
         {
             return ExecuteInTransaction(uow =>
             {
-                var phoneNumber = uow.IdentityUsers.Get().Include(m => m.Mentor).Where(m => m.Mentor.Id.Equals(mentorId)).Select(m => m.PhoneNumber).FirstOrDefault();
+                var phoneNumber = uow.IdentityUsers.Get().Include(m => m.Mentor).Where(m => m.Mentor.Id.Equals(mentorId)).Select(m => m.PhoneNumber).First();
                 var statusMatch =  uow.Matches.Get()
                                             .Include(m => m.Mentor)

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
Services/MentorManager.cs:111:36
             return ExecuteInTransaction(uow =>
             {
                 var phoneNumber = uow.IdentityUsers.Get().Include(m => m.Mentor).Where(m => m.Mentor.Id.Equals(mentorId)).Select(m => m.PhoneNumber).FirstOrDefault();
-                var statusMatch =  uow.Matches.Get()
-                                            .Include(m => m.Mentor)
-                                            .ThenInclude(u => u.User)
-                                            .Where(m => m.MentorId.Equals(mentorId) && m.StudentId.Equals(studentId))
-                                            .Select(m => m.Status)
-                                            .FirstOrDefault();
+                var statusMatch =  uow.Matches.Get()
+                                            .Include(m => m.Mentor)
+                                            .ThenInclude(u => u.User)
+                                            .Where(m => m.MentorId.Equals(mentorId) && m.StudentId.Equals(studentId))
+                                            .Select(m => m.Status)
+                                            .First();
 
                 if (statusMatch.Equals(true))

[NoCoverage] Logical mutation
Services/MentorManager.cs:114:57
                 var statusMatch =  uow.Matches.Get()
                                             .Include(m => m.Mentor)
                                             .ThenInclude(u => u.User)
-                                            .Where(m => m.MentorId.Equals(mentorId) && m.StudentId.Equals(studentId))
+                                            .Where(m => m.MentorId.Equals(mentorId) || m.StudentId.Equals(studentId))
                                             .Select(m => m.Status)
                                             .FirstOrDefault();

[NoCoverage] Boolean mutation
Services/MentorManager.cs:118:40
                                             .Select(m => m.Status)
                                             .FirstOrDefault();
 
-                if (statusMatch.Equals(true))
+                if (statusMatch.Equals(false))
 
                 {

[NoCoverage] Negate expression
Services/MentorManager.cs:118:21
                                             .Select(m => m.Status)
                                             .FirstOrDefault();
 
-                if (statusMatch.Equals(true))
+                if (!(statusMatch.Equals(true)))
 
                 {

[NoCoverage] Block removal mutation
Services/MentorManager.cs:120:17
 
                 if (statusMatch.Equals(true))
 
-                {
-                    return phoneNumber;
-                }
+                {}
                 else
                     return "";

[NoCoverage] String mutation
Services/MentorManager.cs:124:28
                     return phoneNumber;
                 }
                 else
-                    return "";
+                    return "Stryker was here!";
                 
 

[NoCoverage] Equality mutation
Services/MentorManager.cs:133:65
         {
             return ExecuteInTransaction(uow =>
             {
-                var roleID = uow.IdentityRoles.Get().Where(r => r.Name == "Mentor").Select(r => r.Id).FirstOrDefault();
+                var roleID = uow.IdentityRoles.Get().Where(r => r.Name != "Mentor").Select(r => r.Id).FirstOrDefault();
                 var result =  uow.IdentityUsers.Get()
                                         .Where(m => m.Username.Equals(username) && m.RoleId.Equals(roleID) && m.IsDeleted.Equals(false))

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
Services/MentorManager.cs:133:30
         {
             return ExecuteInTransaction(uow =>
             {
-                var roleID = uow.IdentityRoles.Get().Where(r => r.Name == "Mentor").Select(r => r.Id).FirstOrDefault();
+                var roleID = uow.IdentityRoles.Get().Where(r => r.Name == "Mentor").Select(r => r.Id).First();
                 var result =  uow.IdentityUsers.Get()
                                         .Where(m => m.Username.Equals(username) && m.RoleId.Equals(roleID) && m.IsDeleted.Equals(false))

[NoCoverage] Logical mutation
Services/MentorManager.cs:135:53
             {
                 var roleID = uow.IdentityRoles.Get().Where(r => r.Name == "Mentor").Select(r => r.Id).FirstOrDefault();
                 var result =  uow.IdentityUsers.Get()
-                                        .Where(m => m.Username.Equals(username) && m.RoleId.Equals(roleID) && m.IsDeleted.Equals(false))
+                                        .Where(m => m.Username.Equals(username) && m.RoleId.Equals(roleID) || m.IsDeleted.Equals(false))
                                         .Select(m => new MentorByIdViewByStudentDTO
                                         {

[NoCoverage] Boolean mutation
Services/MentorManager.cs:135:130
             {
                 var roleID = uow.IdentityRoles.Get().Where(r => r.Name == "Mentor").Select(r => r.Id).FirstOrDefault();
                 var result =  uow.IdentityUsers.Get()
-                                        .Where(m => m.Username.Equals(username) && m.RoleId.Equals(roleID) && m.IsDeleted.Equals(false))
+                                        .Where(m => m.Username.Equals(username) && m.RoleId.Equals(roleID) && m.IsDeleted.Equals(true))
                                         .Select(m => new MentorByIdViewByStudentDTO
                                         {

[NoCoverage] Boolean mutation
Services/MentorManager.cs:155:85
                 var result = uow.Mentors.Get()
                                                 .Include(m => m.User)
                                                 .ThenInclude(u => u.Adress)
-                                                .Where(m => m.User.IsDeleted.Equals(false))
+                                                .Where(m => m.User.IsDeleted.Equals(true))
                                                 .Select(m => new MentorsLocationsDTO
                                                 {

[NoCoverage] Boolean mutation
Services/MentorManager.cs:179:116
                 return uow.Mentors.Get()
                                         .Include(m => m.User)
                                         .ThenInclude(u => u.Adress)
-                                        .Where(m => m.User.Adress.Id.Equals(locationId) && m.User.IsDeleted.Equals(false))
+                                        .Where(m => m.User.Adress.Id.Equals(locationId) && m.User.IsDeleted.Equals(true))
                                         .Select(m => new MentorByIdViewByStudentDTO
                                         {

[NoCoverage] Logical mutation
Services/MentorManager.cs:179:53
                 return uow.Mentors.Get()
                                         .Include(m => m.User)
                                         .ThenInclude(u => u.Adress)
-                                        .Where(m => m.User.Adress.Id.Equals(locationId) && m.User.IsDeleted.Equals(false))
+                                        .Where(m => m.User.Adress.Id.Equals(locationId) || m.User.IsDeleted.Equals(false))
                                         .Select(m => new MentorByIdViewByStudentDTO
                                         {

[NoCoverage] Object initializer mutation
Services/MentorManager.cs:180:54
                                         .Include(m => m.User)
                                         .ThenInclude(u => u.Adress)
                                         .Where(m => m.User.Adress.Id.Equals(locationId) && m.User.IsDeleted.Equals(false))
-                                        .Select(m => new MentorByIdViewByStudentDTO
-                                        {
-                                            // UserImage = m.User.UserImage,
-                                            Username = m.User.Username,
-                                            Email = m.User.Email,
-                                            Bio = m.User.Bio,
-                                            EducationalInstitution = m.User.EducationalInstitution
-                                        })
+                                        .Select(m => new MentorByIdViewByStudentDTO
+{})
                                         .ToList();
             });

[NoCoverage] Equality mutation
Services/MentorManager.cs:217:98
                                         City = match.Student.User.Adress.City,
                                         County = match.Student.User.Adress.County,
                                         AddressInfo = match.Student.User.Adress.AddressInfo,
-                                        Subject = match.Mentor.Announcements.FirstOrDefault(m => m.Id == match.AnnouncementId).Subject,
+                                        Subject = match.Mentor.Announcements.FirstOrDefault(m => m.Id != match.AnnouncementId).Subject,
                                         ReviewStatus = "ReviewStudent"
                                     })

[NoCoverage] Linq method mutation (SingleOrDefault() to Single())
Services/MentorManager.cs:230:30
         {
             return ExecuteInTransaction(uow =>
             {
-                var mentor = uow.Mentors.Get().Include(m => m.User)
-                .ThenInclude(a => a.Adress)
-                                                .Where(m => m.Id.Equals(id))
-                                                .SingleOrDefault();
+                var mentor = uow.Mentors.Get().Include(m => m.User)
+                .ThenInclude(a => a.Adress)
+                                                .Where(m => m.Id.Equals(id))
+                                                .Single();
                 mentor.MentorIdentityCardBack = mentorUpdateDTO.MentorIdentityCardBack;
                 mentor.MentorIdentityCardFront = mentorUpdateDTO.MentorIdentityCardFront;

[NoCoverage] Statement mutation
Services/MentorManager.cs:252:17
                 mentor.User.Adress.City = mentorUpdateDTO.City;
                 mentor.User.Adress.County = mentorUpdateDTO.County;
 
-                uow.Mentors.Update(mentor);
+                ;
                 uow.SaveChanges();
                 return true;

[NoCoverage] Statement mutation
Services/MentorManager.cs:253:17
                 mentor.User.Adress.County = mentorUpdateDTO.County;
 
                 uow.Mentors.Update(mentor);
-                uow.SaveChanges();
+                ;
                 return true;
             });

[NoCoverage] Linq method mutation (SingleOrDefault() to Single())
Services/MentorManager.cs:262:30
         {
             return ExecuteInTransaction(uow =>
             {
-                var mentor = uow.Mentors.Get()
-                                                .Where(m => m.Id.Equals(id))
-                                                .SingleOrDefault();
+                var mentor = uow.Mentors.Get()
+                                                .Where(m => m.Id.Equals(id))
+                                                .Single();
 
                 mentor.MentorIdentityCardBack = mentorUpdate.MentorIdentityCardBack;

[NoCoverage] Linq method mutation (SingleOrDefault() to Single())
Services/MentorManager.cs:279:30
         {
             return ExecuteInTransaction(uow =>
             {
-                var mentor = uow.Mentors.Get().Include(m => m.User)
-                                                .Where(m => m.Id.Equals(id))
-                                                .SingleOrDefault();
+                var mentor = uow.Mentors.Get().Include(m => m.User)
+                                                .Where(m => m.Id.Equals(id))
+                                                .Single();
                 if (mentor == null)
                 {

[NoCoverage] Equality mutation
Services/MentorManager.cs:282:21
                 var mentor = uow.Mentors.Get().Include(m => m.User)
                                                 .Where(m => m.Id.Equals(id))
                                                 .SingleOrDefault();
-                if (mentor == null)
+                if (mentor != null)
                 {
                     return false;   

[NoCoverage] Statement mutation
Services/MentorManager.cs:287:17
                     return false;   
                 }
                 mentor.User.IsDeleted = isDeleted;
-                uow.Mentors.Update(mentor);
+                ;
                 uow.SaveChanges();
                 return isDeleted;
