[NoCoverage] Equality mutation
Services/ReviewService.cs:24:70
         {
             return ExecuteInTransaction( uow =>
             {
-                var student = uow.Students.Get().FirstOrDefault(s => s.User.Email == reviewModel.StudentEmail);
+                var student = uow.Students.Get().FirstOrDefault(s => s.User.Email != reviewModel.StudentEmail);
                 var mentor = uow.Mentors.Get().FirstOrDefault(s => s.User.Email == reviewModel.MentorEmail);
                 var review = new Review();

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
Services/ReviewService.cs:24:31
         {
             return ExecuteInTransaction( uow =>
             {
-                var student = uow.Students.Get().FirstOrDefault(s => s.User.Email == reviewModel.StudentEmail);
+                var student = uow.Students.Get().First(s => s.User.Email == reviewModel.StudentEmail);
                 var mentor = uow.Mentors.Get().FirstOrDefault(s => s.User.Email == reviewModel.MentorEmail);
                 var review = new Review();

[NoCoverage] Equality mutation
Services/ReviewService.cs:25:68
             return ExecuteInTransaction( uow =>
             {
                 var student = uow.Students.Get().FirstOrDefault(s => s.User.Email == reviewModel.StudentEmail);
-                var mentor = uow.Mentors.Get().FirstOrDefault(s => s.User.Email == reviewModel.MentorEmail);
+                var mentor = uow.Mentors.Get().FirstOrDefault(s => s.User.Email != reviewModel.MentorEmail);
                 var review = new Review();
                 review.Id = Guid.NewGuid();

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
Services/ReviewService.cs:25:30
             return ExecuteInTransaction( uow =>
             {
                 var student = uow.Students.Get().FirstOrDefault(s => s.User.Email == reviewModel.StudentEmail);
-                var mentor = uow.Mentors.Get().FirstOrDefault(s => s.User.Email == reviewModel.MentorEmail);
+                var mentor = uow.Mentors.Get().First(s => s.User.Email == reviewModel.MentorEmail);
                 var review = new Review();
                 review.Id = Guid.NewGuid();

[NoCoverage] Statement mutation
Services/ReviewService.cs:34:17
                // review.CommentDate = DateTime.UtcNow;
                 review.StarsNumber = reviewModel.StarsNumber;
                 review.ReviewStatus = reviewModel.ReviewStatus;
-                uow.Reviews.Insert(review);
+                ;
                 uow.SaveChanges();
                 return  review;

[NoCoverage] Statement mutation
Services/ReviewService.cs:35:17
                 review.StarsNumber = reviewModel.StarsNumber;
                 review.ReviewStatus = reviewModel.ReviewStatus;
                 uow.Reviews.Insert(review);
-                uow.SaveChanges();
+                ;
                 return  review;
             });

[NoCoverage] Linq method mutation (Single() to SingleOrDefault())
Services/ReviewService.cs:45:32
             return ExecuteInTransaction(uow =>
             {
 
-                var comment =  uow.Reviews.Get()
-                                                .Where(cd => cd.Id.Equals(id))
-                                                .Single();
+                var comment =  uow.Reviews.Get()
+                                                .Where(cd => cd.Id.Equals(id))
+                                                .SingleOrDefault();
                 if (comment == null)
                 {

[NoCoverage] Equality mutation
Services/ReviewService.cs:48:21
                 var comment =  uow.Reviews.Get()
                                                 .Where(cd => cd.Id.Equals(id))
                                                 .Single();
-                if (comment == null)
+                if (comment != null)
                 {
                     return false;

[NoCoverage] Statement mutation
Services/ReviewService.cs:52:17
                 {
                     return false;
                 }
-                uow.Reviews.Delete(comment);
+                ;
                 uow.SaveChanges();
                 return true;

[NoCoverage] Statement mutation
Services/ReviewService.cs:53:17
                     return false;
                 }
                 uow.Reviews.Delete(comment);
-                uow.SaveChanges();
+                ;
                 return true;
 

[NoCoverage] Linq method mutation (OrderByDescending() to OrderBy())
Services/ReviewService.cs:63:24
         {
             return ExecuteInTransaction(uow =>
             {
-                return uow.Reviews.Get()
-                                             .Include(cd => cd.Mentor)
-                                             .ThenInclude(u => u.User)
-                                             .Where(cd => cd.MentorId.Equals(mentorId) && cd.ReviewStatus.Equals(StatusReview.ReviewMentor.ToString()))
-                                             .Select(cd => new ViewMentorReview
-                                             {
-                                                 StudentName = uow.IdentityUsers.Get()
-                                                         .Where(u => u.Id.Equals(cd.StudentId))
-                                                          .Select(u => u.Username)
-                                                          .Single(),
-                                                 Message = cd.Message,
-                                                 StarsNumber = cd.StarsNumber,
-                                                 UserImage = uow.IdentityUsers.Get().Where(u => u.Id.Equals(cd.StudentId)).Select(u => u.UserImage).Single(),
-                                             })
-                                             .OrderByDescending(cd => cd.StarsNumber)
-                                             .ToList();
+                return uow.Reviews.Get()
+                                             .Include(cd => cd.Mentor)
+                                             .ThenInclude(u => u.User)
+                                             .Where(cd => cd.MentorId.Equals(mentorId) && cd.ReviewStatus.Equals(StatusReview.ReviewMentor.ToString()))
+                                             .Select(cd => new ViewMentorReview
+                                             {
+                                                 StudentName = uow.IdentityUsers.Get()
+                                                         .Where(u => u.Id.Equals(cd.StudentId))
+                                                          .Select(u => u.Username)
+                                                          .Single(),
+                                                 Message = cd.Message,
+                                                 StarsNumber = cd.StarsNumber,
+                                                 UserImage = uow.IdentityUsers.Get().Where(u => u.Id.Equals(cd.StudentId)).Select(u => u.UserImage).Single(),
+                                             })
+                                             .OrderBy(cd => cd.StarsNumber)
+                                             .ToList();
             });
         }

[NoCoverage] Logical mutation
Services/ReviewService.cs:66:59
                 return uow.Reviews.Get()
                                              .Include(cd => cd.Mentor)
                                              .ThenInclude(u => u.User)
-                                             .Where(cd => cd.MentorId.Equals(mentorId) && cd.ReviewStatus.Equals(StatusReview.ReviewMentor.ToString()))
+                                             .Where(cd => cd.MentorId.Equals(mentorId) || cd.ReviewStatus.Equals(StatusReview.ReviewMentor.ToString()))
                                              .Select(cd => new ViewMentorReview
                                              {

[NoCoverage] Linq method mutation (Single() to SingleOrDefault())
Services/ReviewService.cs:69:64
                                              .Where(cd => cd.MentorId.Equals(mentorId) && cd.ReviewStatus.Equals(StatusReview.ReviewMentor.ToString()))
                                              .Select(cd => new ViewMentorReview
                                              {
-                                                 StudentName = uow.IdentityUsers.Get()
-                                                         .Where(u => u.Id.Equals(cd.StudentId))
-                                                          .Select(u => u.Username)
-                                                          .Single(),
+                                                 StudentName = uow.IdentityUsers.Get()
+                                                         .Where(u => u.Id.Equals(cd.StudentId))
+                                                          .Select(u => u.Username)
+                                                          .SingleOrDefault(),
                                                  Message = cd.Message,
                                                  StarsNumber = cd.StarsNumber,

[NoCoverage] Linq method mutation (Single() to SingleOrDefault())
Services/ReviewService.cs:75:62
                                                           .Single(),
                                                  Message = cd.Message,
                                                  StarsNumber = cd.StarsNumber,
-                                                 UserImage = uow.IdentityUsers.Get().Where(u => u.Id.Equals(cd.StudentId)).Select(u => u.UserImage).Single(),
+                                                 UserImage = uow.IdentityUsers.Get().Where(u => u.Id.Equals(cd.StudentId)).Select(u => u.UserImage).SingleOrDefault(),
                                              })
                                              .OrderByDescending(cd => cd.StarsNumber)

[NoCoverage] Linq method mutation (OrderBy() to OrderByDescending())
Services/ReviewService.cs:85:24
         {
             return ExecuteInTransaction(uow =>
             {
-                return uow.Reviews.Get()
-                                             .Include(cd => cd.Mentor)
-                                             .ThenInclude(u => u.User)
-                                             .Where(cd => cd.MentorId.Equals(mentorId) && cd.ReviewStatus.Equals(StatusReview.ReviewMentor.ToString()))
-                                             .Select(cd => new ViewMentorReview
-                                             {
-                                                 StudentName = uow.IdentityUsers.Get()
-                                                         .Where(u => u.Id.Equals(cd.StudentId))
-                                                          .Select(u => u.Username)
-                                                          .Single(),
-                                                 Message = cd.Message,
-                                                 StarsNumber = cd.StarsNumber,
-                                                 UserImage = uow.IdentityUsers.Get().Where(u => u.Id.Equals(cd.StudentId)).Select(u => u.UserImage).Single(),
-                                             })
-                                             .OrderBy(cd => cd.StarsNumber)
-                                             .ToList();
+                return uow.Reviews.Get()
+                                             .Include(cd => cd.Mentor)
+                                             .ThenInclude(u => u.User)
+                                             .Where(cd => cd.MentorId.Equals(mentorId) && cd.ReviewStatus.Equals(StatusReview.ReviewMentor.ToString()))
+                                             .Select(cd => new ViewMentorReview
+                                             {
+                                                 StudentName = uow.IdentityUsers.Get()
+                                                         .Where(u => u.Id.Equals(cd.StudentId))
+                                                          .Select(u => u.Username)
+                                                          .Single(),
+                                                 Message = cd.Message,
+                                                 StarsNumber = cd.StarsNumber,
+                                                 UserImage = uow.IdentityUsers.Get().Where(u => u.Id.Equals(cd.StudentId)).Select(u => u.UserImage).Single(),
+                                             })
+                                             .OrderByDescending(cd => cd.StarsNumber)
+                                             .ToList();
             });
         }

[NoCoverage] Linq method mutation (OrderByDescending() to OrderBy())
Services/ReviewService.cs:108:24
         {
             return ExecuteInTransaction(uow =>
             {
-                return uow.Reviews.Get()
-                                             .Include(cd => cd.Student)
-                                             .ThenInclude(u => u.User)
-                                             .Where(cd => cd.StudentId.Equals(studentId) && cd.ReviewStatus.Equals(StatusReview.ReviewStudent.ToString()))
-                                             .Select(cd => new ViewStudentReview
-                                             {
-                                                 MentorName = uow.IdentityUsers.Get()
-                                                         .Where(u => u.Id.Equals(cd.MentorId))
-                                                          .Select(u => u.Username)
-                                                          .Single(),
-                                                 Message = cd.Message,
-                                                 StarsNumber = cd.StarsNumber,
-                                                 UserImage = uow.IdentityUsers.Get().Where(u => u.Id.Equals(cd.MentorId)).Select(u => u.UserImage).Single(),
-                                             })
-                                             .OrderByDescending(cd => cd.StarsNumber)
-                                             .ToList();
+                return uow.Reviews.Get()
+                                             .Include(cd => cd.Student)
+                                             .ThenInclude(u => u.User)
+                                             .Where(cd => cd.StudentId.Equals(studentId) && cd.ReviewStatus.Equals(StatusReview.ReviewStudent.ToString()))
+                                             .Select(cd => new ViewStudentReview
+                                             {
+                                                 MentorName = uow.IdentityUsers.Get()
+                                                         .Where(u => u.Id.Equals(cd.MentorId))
+                                                          .Select(u => u.Username)
+                                                          .Single(),
+                                                 Message = cd.Message,
+                                                 StarsNumber = cd.StarsNumber,
+                                                 UserImage = uow.IdentityUsers.Get().Where(u => u.Id.Equals(cd.MentorId)).Select(u => u.UserImage).Single(),
+                                             })
+                                             .OrderBy(cd => cd.StarsNumber)
+                                             .ToList();
             });
         }

[NoCoverage] Logical mutation
Services/ReviewService.cs:111:59
                 return uow.Reviews.Get()
                                              .Include(cd => cd.Student)
                                              .ThenInclude(u => u.User)
-                                             .Where(cd => cd.StudentId.Equals(studentId) && cd.ReviewStatus.Equals(StatusReview.ReviewStudent.ToString()))
+                                             .Where(cd => cd.StudentId.Equals(studentId) || cd.ReviewStatus.Equals(StatusReview.ReviewStudent.ToString()))
                                              .Select(cd => new ViewStudentReview
                                              {

[NoCoverage] Linq method mutation (Single() to SingleOrDefault())
Services/ReviewService.cs:114:63
                                              .Where(cd => cd.StudentId.Equals(studentId) && cd.ReviewStatus.Equals(StatusReview.ReviewStudent.ToString()))
                                              .Select(cd => new ViewStudentReview
                                              {
-                                                 MentorName = uow.IdentityUsers.Get()
-                                                         .Where(u => u.Id.Equals(cd.MentorId))
-                                                          .Select(u => u.Username)
-                                                          .Single(),
+                                                 MentorName = uow.IdentityUsers.Get()
+                                                         .Where(u => u.Id.Equals(cd.MentorId))
+                                                          .Select(u => u.Username)
+                                                          .SingleOrDefault(),
                                                  Message = cd.Message,
                                                  StarsNumber = cd.StarsNumber,

[NoCoverage] Linq method mutation (Single() to SingleOrDefault())
Services/ReviewService.cs:120:62
                                                           .Single(),
                                                  Message = cd.Message,
                                                  StarsNumber = cd.StarsNumber,
-                                                 UserImage = uow.IdentityUsers.Get().Where(u => u.Id.Equals(cd.MentorId)).Select(u => u.UserImage).Single(),
+                                                 UserImage = uow.IdentityUsers.Get().Where(u => u.Id.Equals(cd.MentorId)).Select(u => u.UserImage).SingleOrDefault(),
                                              })
                                              .OrderByDescending(cd => cd.StarsNumber)

[NoCoverage] Linq method mutation (OrderBy() to OrderByDescending())
Services/ReviewService.cs:130:24
         {
             return ExecuteInTransaction(uow =>
             {
-                return uow.Reviews.Get()
-                                             .Include(cd => cd.Student)
-                                             .ThenInclude(u => u.User)
-                                             .Where(cd => cd.StudentId.Equals(studentId) && cd.ReviewStatus.Equals(StatusReview.ReviewStudent.ToString()) )
-                                             .Select(cd => new ViewStudentReview
-                                             {
-                                                 MentorName = uow.IdentityUsers.Get()
-                                                         .Where(u => u.Id.Equals(cd.MentorId))
-                                                          .Select(u => u.Username)
-                                                          .Single(),
-                                                 Message = cd.Message,
-                                                 StarsNumber = cd.StarsNumber,
-                                                 UserImage = uow.IdentityUsers.Get().Where(u => u.Id.Equals(cd.MentorId)).Select(u => u.UserImage).Single(),
-                                             })
-                                             .OrderBy(cd => cd.StarsNumber)
-                                             .ToList();
+                return uow.Reviews.Get()
+                                             .Include(cd => cd.Student)
+                                             .ThenInclude(u => u.User)
+                                             .Where(cd => cd.StudentId.Equals(studentId) && cd.ReviewStatus.Equals(StatusReview.ReviewStudent.ToString()) )
+                                             .Select(cd => new ViewStudentReview
+                                             {
+                                                 MentorName = uow.IdentityUsers.Get()
+                                                         .Where(u => u.Id.Equals(cd.MentorId))
+                                                          .Select(u => u.Username)
+                                                          .Single(),
+                                                 Message = cd.Message,
+                                                 StarsNumber = cd.StarsNumber,
+                                                 UserImage = uow.IdentityUsers.Get().Where(u => u.Id.Equals(cd.MentorId)).Select(u => u.UserImage).Single(),
+                                             })
+                                             .OrderByDescending(cd => cd.StarsNumber)
+                                             .ToList();
             });
         }

[NoCoverage] Linq method mutation (OrderByDescending() to OrderBy())
Services/ReviewService.cs:153:24
         {
             return ExecuteInTransaction(uow =>
             {
-                return uow.Reviews.Get()
-                                             .Include(cd => cd.Student)
-                                             .ThenInclude(u => u.User)
-                                             .Where(cd => cd.StudentId.Equals(studentId) && cd.ReviewStatus.Equals(StatusReview.ReviewMentor.ToString()))
-                                             .Select(cd => new ViewStudentReviewWithId
-                                             {
-                                                 Id = cd.Id,
-                                                 MentorName = uow.IdentityUsers.Get()
-                                                         .Where(u => u.Id.Equals(cd.MentorId))
-                                                          .Select(u => u.Username)
-                                                          .Single(),
-                                                 Message = cd.Message,
-                                                 StarsNumber = cd.StarsNumber,
-                                                 UserImage = uow.IdentityUsers.Get().Where(u => u.Id.Equals(cd.MentorId)).Select(u => u.UserImage).Single(),
-                                             })
-                                             .OrderByDescending(cd => cd.StarsNumber)
-                                             .ToList();
+                return uow.Reviews.Get()
+                                             .Include(cd => cd.Student)
+                                             .ThenInclude(u => u.User)
+                                             .Where(cd => cd.StudentId.Equals(studentId) && cd.ReviewStatus.Equals(StatusReview.ReviewMentor.ToString()))
+                                             .Select(cd => new ViewStudentReviewWithId
+                                             {
+                                                 Id = cd.Id,
+                                                 MentorName = uow.IdentityUsers.Get()
+                                                         .Where(u => u.Id.Equals(cd.MentorId))
+                                                          .Select(u => u.Username)
+                                                          .Single(),
+                                                 Message = cd.Message,
+                                                 StarsNumber = cd.StarsNumber,
+                                                 UserImage = uow.IdentityUsers.Get().Where(u => u.Id.Equals(cd.MentorId)).Select(u => u.UserImage).Single(),
+                                             })
+                                             .OrderBy(cd => cd.StarsNumber)
+                                             .ToList();
             });
         }

[NoCoverage] Logical mutation
Services/ReviewService.cs:156:59
                 return uow.Reviews.Get()
                                              .Include(cd => cd.Student)
                                              .ThenInclude(u => u.User)
-                                             .Where(cd => cd.StudentId.Equals(studentId) && cd.ReviewStatus.Equals(StatusReview.ReviewMentor.ToString()))
+                                             .Where(cd => cd.StudentId.Equals(studentId) || cd.ReviewStatus.Equals(StatusReview.ReviewMentor.ToString()))
                                              .Select(cd => new ViewStudentReviewWithId
                                              {

[NoCoverage] Linq method mutation (Single() to SingleOrDefault())
Services/ReviewService.cs:160:63
                                              .Select(cd => new ViewStudentReviewWithId
                                              {
                                                  Id = cd.Id,
-                                                 MentorName = uow.IdentityUsers.Get()
-                                                         .Where(u => u.Id.Equals(cd.MentorId))
-                                                          .Select(u => u.Username)
-                                                          .Single(),
+                                                 MentorName = uow.IdentityUsers.Get()
+                                                         .Where(u => u.Id.Equals(cd.MentorId))
+                                                          .Select(u => u.Username)
+                                                          .SingleOrDefault(),
                                                  Message = cd.Message,
                                                  StarsNumber = cd.StarsNumber,

[NoCoverage] Linq method mutation (OrderByDescending() to OrderBy())
Services/ReviewService.cs:177:24
         {
             return ExecuteInTransaction(uow =>
             {
-                return uow.Reviews.Get()
-                                             .Include(cd => cd.Mentor)
-                                             .ThenInclude(u => u.User)
-                                             .Where(cd => cd.MentorId.Equals(mentorId) && cd.ReviewStatus.Equals(StatusReview.ReviewStudent.ToString()))
-                                             .Select(cd => new ViewMentorReviewWithId
-                                             {
-                                                 Id = cd.Id,
-                                                 StudentName = uow.IdentityUsers.Get()
-                                                         .Where(u => u.Id.Equals(cd.StudentId))
-                                                          .Select(u => u.Username)
-                                                          .Single(),
-                                                 Message = cd.Message,
-                                                 StarsNumber = cd.StarsNumber,
-                                                 UserImage = uow.IdentityUsers.Get().Where(u => u.Id.Equals(cd.StudentId)).Select(u => u.UserImage).Single(),
-                                             })
-                                             .OrderByDescending(cd => cd.StarsNumber)
-                                             .ToList();
+                return uow.Reviews.Get()
+                                             .Include(cd => cd.Mentor)
+                                             .ThenInclude(u => u.User)
+                                             .Where(cd => cd.MentorId.Equals(mentorId) && cd.ReviewStatus.Equals(StatusReview.ReviewStudent.ToString()))
+                                             .Select(cd => new ViewMentorReviewWithId
+                                             {
+                                                 Id = cd.Id,
+                                                 StudentName = uow.IdentityUsers.Get()
+                                                         .Where(u => u.Id.Equals(cd.StudentId))
+                                                          .Select(u => u.Username)
+                                                          .Single(),
+                                                 Message = cd.Message,
+                                                 StarsNumber = cd.StarsNumber,
+                                                 UserImage = uow.IdentityUsers.Get().Where(u => u.Id.Equals(cd.StudentId)).Select(u => u.UserImage).Single(),
+                                             })
+                                             .OrderBy(cd => cd.StarsNumber)
+                                             .ToList();
             });
         }

[NoCoverage] Logical mutation
Services/ReviewService.cs:180:59
                 return uow.Reviews.Get()
                                              .Include(cd => cd.Mentor)
                                              .ThenInclude(u => u.User)
-                                             .Where(cd => cd.MentorId.Equals(mentorId) && cd.ReviewStatus.Equals(StatusReview.ReviewStudent.ToString()))
+                                             .Where(cd => cd.MentorId.Equals(mentorId) || cd.ReviewStatus.Equals(StatusReview.ReviewStudent.ToString()))
                                              .Select(cd => new ViewMentorReviewWithId
                                              {
