[NoCoverage] Linq method mutation (Single() to SingleOrDefault())
Services/ReviewService.cs:184:64
                                              .Select(cd => new ViewMentorReviewWithId
                                              {
                                                  Id = cd.Id,
-                                                 StudentName = uow.IdentityUsers.Get()
-                                                         .Where(u => u.Id.Equals(cd.StudentId))
-                                                          .Select(u => u.Username)
-                                                          .Single(),
+                                                 StudentName = uow.IdentityUsers.Get()
+                                                         .Where(u => u.Id.Equals(cd.StudentId))
+                                                          .Select(u => u.Username)
+                                                          .SingleOrDefault(),
                                                  Message = cd.Message,
                                                  StarsNumber = cd.StarsNumber,

[NoCoverage] Linq method mutation (Average() to Min())
Services/ReviewService.cs:199:36
 
         public double GetMentorStarsAverageRating(Guid id)
         {
-            double averageRating = UnitOfWork.Reviews.Get().Where(sr => sr.MentorId.Equals(id) && sr.ReviewStatus.Equals(StatusReview.ReviewMentor.ToString())).Average(cd => cd.StarsNumber);
+            double averageRating = UnitOfWork.Reviews.Get().Where(sr => sr.MentorId.Equals(id) && sr.ReviewStatus.Equals(StatusReview.ReviewMentor.ToString())).Min(cd => cd.StarsNumber);
             return averageRating;
         }

[NoCoverage] Logical mutation
Services/ReviewService.cs:199:73
 
         public double GetMentorStarsAverageRating(Guid id)
         {
-            double averageRating = UnitOfWork.Reviews.Get().Where(sr => sr.MentorId.Equals(id) && sr.ReviewStatus.Equals(StatusReview.ReviewMentor.ToString())).Average(cd => cd.StarsNumber);
+            double averageRating = UnitOfWork.Reviews.Get().Where(sr => sr.MentorId.Equals(id) || sr.ReviewStatus.Equals(StatusReview.ReviewMentor.ToString())).Average(cd => cd.StarsNumber);
             return averageRating;
         }

[NoCoverage] Logical mutation
Services/ReviewService.cs:204:63
         }
         public double GetMentorStarsAverageRatingGood(Guid id)//id mentor
         {
-            var review = UnitOfWork.Reviews.Get().Where(sr => sr.MentorId.Equals(id) && sr.ReviewStatus.Equals(StatusReview.ReviewMentor.ToString()));
+            var review = UnitOfWork.Reviews.Get().Where(sr => sr.MentorId.Equals(id) || sr.ReviewStatus.Equals(StatusReview.ReviewMentor.ToString()));
             if (review.Count() == 0)
             {

[NoCoverage] Equality mutation
Services/ReviewService.cs:205:17
         public double GetMentorStarsAverageRatingGood(Guid id)//id mentor
         {
             var review = UnitOfWork.Reviews.Get().Where(sr => sr.MentorId.Equals(id) && sr.ReviewStatus.Equals(StatusReview.ReviewMentor.ToString()));
-            if (review.Count() == 0)
+            if (review.Count() != 0)
             {
                 return 0;

[NoCoverage] Block removal mutation
Services/ReviewService.cs:206:13
         {
             var review = UnitOfWork.Reviews.Get().Where(sr => sr.MentorId.Equals(id) && sr.ReviewStatus.Equals(StatusReview.ReviewMentor.ToString()));
             if (review.Count() == 0)
-            {
-                return 0;
-            }
+            {}
             else
             {

[NoCoverage] Linq method mutation (Average() to Min())
Services/ReviewService.cs:211:48
             }
             else
             {
-                double averageRating = (double)review.Average(cd => cd.StarsNumber);
+                double averageRating = (double)review.Min(cd => cd.StarsNumber);
                 return Math.Ceiling(averageRating);
             }

[NoCoverage] Equality mutation
Services/ReviewService.cs:223:57
             var review = UnitOfWork.Reviews.Get()
                                             .Include(m => m.Mentor)
                                             .ThenInclude(mm => mm.User)
-                                           .Where(sr => sr.Mentor.User.Email == email && sr.ReviewStatus.Equals(StatusReview.ReviewMentor.ToString()));
+                                           .Where(sr => sr.Mentor.User.Email != email && sr.ReviewStatus.Equals(StatusReview.ReviewMentor.ToString()));
             if (review.Count() == 0)
             {

[NoCoverage] Logical mutation
Services/ReviewService.cs:223:57
             var review = UnitOfWork.Reviews.Get()
                                             .Include(m => m.Mentor)
                                             .ThenInclude(mm => mm.User)
-                                           .Where(sr => sr.Mentor.User.Email == email && sr.ReviewStatus.Equals(StatusReview.ReviewMentor.ToString()));
+                                           .Where(sr => sr.Mentor.User.Email == email || sr.ReviewStatus.Equals(StatusReview.ReviewMentor.ToString()));
             if (review.Count() == 0)
             {

[NoCoverage] Equality mutation
Services/ReviewService.cs:224:17
                                             .Include(m => m.Mentor)
                                             .ThenInclude(mm => mm.User)
                                            .Where(sr => sr.Mentor.User.Email == email && sr.ReviewStatus.Equals(StatusReview.ReviewMentor.ToString()));
-            if (review.Count() == 0)
+            if (review.Count() != 0)
             {
                 return 0;

[NoCoverage] Logical mutation
Services/ReviewService.cs:242:57
             var review = UnitOfWork.Reviews.Get()
                                             .Include(m => m.Student)
                                             .ThenInclude(mm => mm.User)
-                                           .Where(sr => sr.Student.User.Email == email && sr.ReviewStatus.Equals(StatusReview.ReviewStudent.ToString()));
+                                           .Where(sr => sr.Student.User.Email == email || sr.ReviewStatus.Equals(StatusReview.ReviewStudent.ToString()));
             if (review.Count() == 0)
             {

[NoCoverage] Equality mutation
Services/ReviewService.cs:242:57
             var review = UnitOfWork.Reviews.Get()
                                             .Include(m => m.Student)
                                             .ThenInclude(mm => mm.User)
-                                           .Where(sr => sr.Student.User.Email == email && sr.ReviewStatus.Equals(StatusReview.ReviewStudent.ToString()));
+                                           .Where(sr => sr.Student.User.Email != email && sr.ReviewStatus.Equals(StatusReview.ReviewStudent.ToString()));
             if (review.Count() == 0)
             {

[NoCoverage] Equality mutation
Services/ReviewService.cs:243:17
                                             .Include(m => m.Student)
                                             .ThenInclude(mm => mm.User)
                                            .Where(sr => sr.Student.User.Email == email && sr.ReviewStatus.Equals(StatusReview.ReviewStudent.ToString()));
-            if (review.Count() == 0)
+            if (review.Count() != 0)
             {
                 return 0;

[NoCoverage] Logical mutation
Services/ReviewService.cs:257:63
         }
         public double GetStudentStarsAverageRating(Guid id)
         {
-            var review = UnitOfWork.Reviews.Get().Where(sr => sr.StudentId.Equals(id) && sr.ReviewStatus.Equals(StatusReview.ReviewStudent.ToString()));
+            var review = UnitOfWork.Reviews.Get().Where(sr => sr.StudentId.Equals(id) || sr.ReviewStatus.Equals(StatusReview.ReviewStudent.ToString()));
 
             if (review.Count() == 0)

[NoCoverage] Equality mutation
Services/ReviewService.cs:259:17
         {
             var review = UnitOfWork.Reviews.Get().Where(sr => sr.StudentId.Equals(id) && sr.ReviewStatus.Equals(StatusReview.ReviewStudent.ToString()));
 
-            if (review.Count() == 0)
+            if (review.Count() != 0)
             {
                 return 0;

[NoCoverage] Linq method mutation (SingleOrDefault() to Single())
Services/ReviewService.cs:274:31
         {
             return ExecuteInTransaction(uow =>
             {
-                var comment = uow.Reviews.Get()
-                                                          .Where(cd => cd.Id.Equals(id))
-                                                          .SingleOrDefault();
+                var comment = uow.Reviews.Get()
+                                                          .Where(cd => cd.Id.Equals(id))
+                                                          .Single();
                 comment.Message = message;
                 uow.Reviews.Update(comment);

[NoCoverage] Statement mutation
Services/ReviewService.cs:278:17
                                                           .Where(cd => cd.Id.Equals(id))
                                                           .SingleOrDefault();
                 comment.Message = message;
-                uow.Reviews.Update(comment);
+                ;
                 uow.SaveChanges();
                 return message;

[NoCoverage] Statement mutation
Services/ReviewService.cs:279:17
                                                           .SingleOrDefault();
                 comment.Message = message;
                 uow.Reviews.Update(comment);
-                uow.SaveChanges();
+                ;
                 return message;
             });
