[NoCoverage] Boolean mutation
Services/StudentService.cs:29:83
                                   .Get()
                                   .Include(u => u.User)
                                   .ThenInclude(l => l.Adress)
-                                  .Where(student => student.User.IsDeleted.Equals(false))
+                                  .Where(student => student.User.IsDeleted.Equals(true))
                                   .Select(student => new StudentDTO
                                   {

[NoCoverage] Object initializer mutation
Services/StudentService.cs:30:54
                                   .Include(u => u.User)
                                   .ThenInclude(l => l.Adress)
                                   .Where(student => student.User.IsDeleted.Equals(false))
-                                  .Select(student => new StudentDTO
-                                  {
-                                     Username = student.User.Username,
-                                     Email = student.User.Email,
-                                     PhoneNumber = student.User.PhoneNumber,
-                                     PasswordHash = student.User.PasswordHash,
-                                     CreatedAt = student.User.CreatedAt,
-                                     IsActive = student.User.IsActive,
-                                     Bio = student.User.Bio,
-                                     EducationalInstitution = student.User.EducationalInstitution,
-                                     StudentGrade = student.StudentGrade,
-                                     StudentSchoolQualification = student.StudentSchoolQualification,
-                                     City = student.User.Adress.City,
-                                     County = student.User.Adress.County,
-                                     AddressInfo = student.User.Adress.AddressInfo
-                                  }).ToList();
+                                  .Select(student => new StudentDTO
+{}).ToList();
                 return students;
             });

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
Services/StudentService.cs:54:31
         {
             return ExecuteInTransaction(db =>
             {
-                var student = db.Students
-                                 .Get()
-                                 .Include(u => u.User)
-                                 .ThenInclude(l => l.Adress)
-                                 .Where(student => student.User.IsDeleted.Equals(false) && student.Id.Equals(studentId))
-                                 .Select(student => new StudentDTO
-                                 {
-                                     Username = student.User.Username,
-                                     Email = student.User.Email,
-                                     PhoneNumber = student.User.PhoneNumber,
-                                     PasswordHash = student.User.PasswordHash,
-                                     CreatedAt = student.User.CreatedAt,
-                                     IsActive = student.User.IsActive,
-                                     Bio = student.User.Bio,
-                                     EducationalInstitution = student.User.EducationalInstitution,
-                                     StudentGrade = student.StudentGrade,
-                                     StudentSchoolQualification = student.StudentSchoolQualification,
-                                     City = student.User.Adress.City,
-                                     County = student.User.Adress.County,
-                                     AddressInfo = student.User.Adress.AddressInfo
-                                 }).FirstOrDefault();
+                var student = db.Students
+                                 .Get()
+                                 .Include(u => u.User)
+                                 .ThenInclude(l => l.Adress)
+                                 .Where(student => student.User.IsDeleted.Equals(false) && student.Id.Equals(studentId))
+                                 .Select(student => new StudentDTO
+                                 {
+                                     Username = student.User.Username,
+                                     Email = student.User.Email,
+                                     PhoneNumber = student.User.PhoneNumber,
+                                     PasswordHash = student.User.PasswordHash,
+                                     CreatedAt = student.User.CreatedAt,
+                                     IsActive = student.User.IsActive,
+                                     Bio = student.User.Bio,
+                                     EducationalInstitution = student.User.EducationalInstitution,
+                                     StudentGrade = student.StudentGrade,
+                                     StudentSchoolQualification = student.StudentSchoolQualification,
+                                     City = student.User.Adress.City,
+                                     County = student.User.Adress.County,
+                                     AddressInfo = student.User.Adress.AddressInfo
+                                 }).First();
                 return student;
             });

[NoCoverage] Logical mutation
Services/StudentService.cs:58:52
                                  .Get()
                                  .Include(u => u.User)
                                  .ThenInclude(l => l.Adress)
-                                 .Where(student => student.User.IsDeleted.Equals(false) && student.Id.Equals(studentId))
+                                 .Where(student => student.User.IsDeleted.Equals(false) || student.Id.Equals(studentId))
                                  .Select(student => new StudentDTO
                                  {

[NoCoverage] Boolean mutation
Services/StudentService.cs:58:82
                                  .Get()
                                  .Include(u => u.User)
                                  .ThenInclude(l => l.Adress)
-                                 .Where(student => student.User.IsDeleted.Equals(false) && student.Id.Equals(studentId))
+                                 .Where(student => student.User.IsDeleted.Equals(true) && student.Id.Equals(studentId))
                                  .Select(student => new StudentDTO
                                  {

[NoCoverage] Logical mutation
Services/StudentService.cs:88:52
                                  .Get()
                                  .Include(u => u.User)
                                  .ThenInclude(l => l.Adress)
-                                 .Where(student => student.User.IsDeleted.Equals(false) && student.User.Username.Equals(name))
+                                 .Where(student => student.User.IsDeleted.Equals(false) || student.User.Username.Equals(name))
                                  .Select(student => new StudentDTO
                                  {

[NoCoverage] Boolean mutation
Services/StudentService.cs:88:82
                                  .Get()
                                  .Include(u => u.User)
                                  .ThenInclude(l => l.Adress)
-                                 .Where(student => student.User.IsDeleted.Equals(false) && student.User.Username.Equals(name))
+                                 .Where(student => student.User.IsDeleted.Equals(true) && student.User.Username.Equals(name))
                                  .Select(student => new StudentDTO
                                  {

[NoCoverage] Object initializer mutation
Services/StudentService.cs:89:53
                                  .Include(u => u.User)
                                  .ThenInclude(l => l.Adress)
                                  .Where(student => student.User.IsDeleted.Equals(false) && student.User.Username.Equals(name))
-                                 .Select(student => new StudentDTO
-                                 {
-                                     Username = student.User.Username,
-                                     Email = student.User.Email,
-                                     PhoneNumber = student.User.PhoneNumber,
-                                     PasswordHash = student.User.PasswordHash,
-                                     CreatedAt = student.User.CreatedAt,
-                                     IsActive = student.User.IsActive,
-                                     Bio = student.User.Bio,
-                                     EducationalInstitution = student.User.EducationalInstitution,
-                                     StudentGrade = student.StudentGrade,
-                                     StudentSchoolQualification = student.StudentSchoolQualification,
-                                     City = student.User.Adress.City,
-                                     County = student.User.Adress.County,
-                                     AddressInfo = student.User.Adress.AddressInfo
-                                 }).ToList();
+                                 .Select(student => new StudentDTO
+{}).ToList();
                 return students;
             });

[NoCoverage] Boolean mutation
Services/StudentService.cs:119:82
                                  .Get()
                                  .Include(u => u.User)
                                  .ThenInclude(l => l.Adress)
-                                 .Where(student => student.User.IsDeleted.Equals(false) && student.User.Adress.Id.Equals(locationId))
+                                 .Where(student => student.User.IsDeleted.Equals(true) && student.User.Adress.Id.Equals(locationId))
                                  .Select(student => new StudentDTO
                                  {

[NoCoverage] Logical mutation
Services/StudentService.cs:119:52
                                  .Get()
                                  .Include(u => u.User)
                                  .ThenInclude(l => l.Adress)
-                                 .Where(student => student.User.IsDeleted.Equals(false) && student.User.Adress.Id.Equals(locationId))
+                                 .Where(student => student.User.IsDeleted.Equals(false) || student.User.Adress.Id.Equals(locationId))
                                  .Select(student => new StudentDTO
                                  {

[NoCoverage] Object initializer mutation
Services/StudentService.cs:152:50
                                 .Include(s => s.Student)
                                 .Include(r => r.Student.Reviews)
-                                .Select(match => new MentorsForStudentDTO
-                                {
-                                    Username = match.Mentor.User.Username,
-                                    Email = match.Mentor.User.Email,
-                                    PhoneNumber = match.Mentor.User.PhoneNumber,
-                                    PasswordHash = match.Mentor.User.PasswordHash,
-                                    CreatedAt = match.Mentor.User.CreatedAt,
-                                    IsActive = match.Mentor.User.IsActive,
-                                    IsDeleted = match.Mentor.User.IsDeleted,
-                                    Bio = match.Mentor.User.Bio,
-                                    EducationalInstitution = match.Mentor.User.EducationalInstitution,
-                                    City = match.Mentor.User.Adress.City,
-                                    County = match.Mentor.User.Adress.County,
-                                    AddressInfo = match.Mentor.User.Adress.AddressInfo,
-                                    Subject = match.Mentor.Announcements.FirstOrDefault(m => m.Id == match.AnnouncementId).Subject,                                  
-                                    ReviewStatus = "ReviewMentor"
-                                })
+                                .Select(match => new MentorsForStudentDTO
+{})
                                 .ToList();
                 return mentors;

[NoCoverage] Equality mutation
Services/StudentService.cs:166:94
                                     City = match.Mentor.User.Adress.City,
                                     County = match.Mentor.User.Adress.County,
                                     AddressInfo = match.Mentor.User.Adress.AddressInfo,
-                                    Subject = match.Mentor.Announcements.FirstOrDefault(m => m.Id == match.AnnouncementId).Subject,                                  
+                                    Subject = match.Mentor.Announcements.FirstOrDefault(m => m.Id != match.AnnouncementId).Subject,                                  
                                     ReviewStatus = "ReviewMentor"
                                 })

[NoCoverage] String mutation
Services/StudentService.cs:167:52
                                     County = match.Mentor.User.Adress.County,
                                     AddressInfo = match.Mentor.User.Adress.AddressInfo,
                                     Subject = match.Mentor.Announcements.FirstOrDefault(m => m.Id == match.AnnouncementId).Subject,                                  
-                                    ReviewStatus = "ReviewMentor"
+                                    ReviewStatus = ""
                                 })
                                 .ToList();

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
Services/StudentService.cs:178:31
         {
             return ExecuteInTransaction(db =>
             {
-            var phoneNumber = db.Matches
-                             .Get()
-                             .Include(m => m.Mentor)
-                             .Where(match => match.StudentId.Equals(studentId) && match.MentorId.Equals(mentorId) && match.Status.Equals(StatusMatch.Accepted.ToString()))//("1")
-                             .Select(match => match.Mentor.User.PhoneNumber).FirstOrDefault();
+            var phoneNumber = db.Matches
+                             .Get()
+                             .Include(m => m.Mentor)
+                             .Where(match => match.StudentId.Equals(studentId) && match.MentorId.Equals(mentorId) && match.Status.Equals(StatusMatch.Accepted.ToString()))//("1")
+                             .Select(match => match.Mentor.User.PhoneNumber).First();
 
                 if (phoneNumber == null)

[NoCoverage] Logical mutation
Services/StudentService.cs:181:46
             var phoneNumber = db.Matches
                              .Get()
                              .Include(m => m.Mentor)
-                             .Where(match => match.StudentId.Equals(studentId) && match.MentorId.Equals(mentorId) && match.Status.Equals(StatusMatch.Accepted.ToString()))//("1")
+                             .Where(match => match.StudentId.Equals(studentId) && match.MentorId.Equals(mentorId) || match.Status.Equals(StatusMatch.Accepted.ToString()))//("1")
                              .Select(match => match.Mentor.User.PhoneNumber).FirstOrDefault();
 

[NoCoverage] Logical mutation
Services/StudentService.cs:181:46
             var phoneNumber = db.Matches
                              .Get()
                              .Include(m => m.Mentor)
-                             .Where(match => match.StudentId.Equals(studentId) && match.MentorId.Equals(mentorId) && match.Status.Equals(StatusMatch.Accepted.ToString()))//("1")
+                             .Where(match => match.StudentId.Equals(studentId) || match.MentorId.Equals(mentorId) && match.Status.Equals(StatusMatch.Accepted.ToString()))//("1")
                              .Select(match => match.Mentor.User.PhoneNumber).FirstOrDefault();
 

[NoCoverage] Equality mutation
Services/StudentService.cs:184:21
                              .Where(match => match.StudentId.Equals(studentId) && match.MentorId.Equals(mentorId) && match.Status.Equals(StatusMatch.Accepted.ToString()))//("1")
                              .Select(match => match.Mentor.User.PhoneNumber).FirstOrDefault();
 
-                if (phoneNumber == null)
+                if (phoneNumber != null)
                     return "";
 

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
Services/StudentService.cs:195:37
         {
             return ExecuteInTransaction(db =>
             {
-                var updateStudent = db.Students
-                                       .Get()
-                                       .Include(u => u.User)
-                                       .ThenInclude(l => l.Adress)
-                                       .Where(st => st.Id.Equals(studentId))
-                                       .FirstOrDefault();
+                var updateStudent = db.Students
+                                       .Get()
+                                       .Include(u => u.User)
+                                       .ThenInclude(l => l.Adress)
+                                       .Where(st => st.Id.Equals(studentId))
+                                       .First();
 
                 updateStudent.User.Username = student.Username;

[NoCoverage] Statement mutation
Services/StudentService.cs:217:17
                 updateStudent.User.Adress.AddressInfo = student.AddressInfo;
 
 
-                db.Students.Update((Student)updateStudent);
+                ;
                 db.SaveChanges();
 

[NoCoverage] Statement mutation
Services/StudentService.cs:218:17
 
 
                 db.Students.Update((Student)updateStudent);
-                db.SaveChanges();
+                ;
 
                 var updatedStudent = GetStudentById(studentId);

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
Services/StudentService.cs:231:39
         {
             return ExecuteInTransaction(db =>
             {
-                var selectedStudent = db.Students
-                                        .Get()
-                                        .Include(u => u.User)
-                                        .Where(st => st.Id.Equals(studentId))
-                                        .FirstOrDefault();
+                var selectedStudent = db.Students
+                                        .Get()
+                                        .Include(u => u.User)
+                                        .Where(st => st.Id.Equals(studentId))
+                                        .First();
 
                 if (selectedStudent == null)

[NoCoverage] Equality mutation
Services/StudentService.cs:237:21
                                         .Where(st => st.Id.Equals(studentId))
                                         .FirstOrDefault();
 
-                if (selectedStudent == null)
+                if (selectedStudent != null)
                     return false;   
                

[NoCoverage] Boolean mutation
Services/StudentService.cs:238:28
                                         .FirstOrDefault();
 
                 if (selectedStudent == null)
-                    return false;   
+                    return true;   
                
                 selectedStudent.User.IsDeleted = true;

[NoCoverage] Boolean mutation
Services/StudentService.cs:240:50
                 if (selectedStudent == null)
                     return false;   
                
-                selectedStudent.User.IsDeleted = true;
+                selectedStudent.User.IsDeleted = false;
                 db.Students.Update(selectedStudent);
                 db.SaveChanges();

[NoCoverage] Statement mutation
Services/StudentService.cs:241:17
                     return false;   
                
                 selectedStudent.User.IsDeleted = true;
-                db.Students.Update(selectedStudent);
+                ;
                 db.SaveChanges();
                 return true;

[NoCoverage] Statement mutation
Services/StudentService.cs:242:17
                
                 selectedStudent.User.IsDeleted = true;
                 db.Students.Update(selectedStudent);
-                db.SaveChanges();
+                ;
                 return true;
             });

[NoCoverage] Boolean mutation
Services/StudentService.cs:243:24
                 selectedStudent.User.IsDeleted = true;
                 db.Students.Update(selectedStudent);
                 db.SaveChanges();
-                return true;
+                return false;
             });
         }
