[NoCoverage] Block removal mutation
Services/UserManagerService.cs:28:9
         private readonly IUserRepository _userRepository;
         
-        {
-            _hashAlgo = hashAlgo;
-            _tokenManager = tokenManager;
-            _signInKeySetting = signInKeySetting;
-            _userRepository = userRepository;
-        }
+        {}
 
 

[NoCoverage] Linq method mutation (SingleOrDefault() to Single())
Services/UserManagerService.cs:40:24
         {
             return ExecuteInTransaction(uow =>
             {
-                return uow.IdentityUsers.Get()
-                             .Where(u => u.Email == CurrentUser.Email)
-                             .Select(u => u.UserImage)
-                            .SingleOrDefault();
+                return uow.IdentityUsers.Get()
+                             .Where(u => u.Email == CurrentUser.Email)
+                             .Select(u => u.UserImage)
+                            .Single();
             });
         }

[NoCoverage] Equality mutation
Services/UserManagerService.cs:41:42
             return ExecuteInTransaction(uow =>
             {
                 return uow.IdentityUsers.Get()
-                             .Where(u => u.Email == CurrentUser.Email)
+                             .Where(u => u.Email != CurrentUser.Email)
                              .Select(u => u.UserImage)
                             .SingleOrDefault();

[NoCoverage] Block removal mutation
Services/UserManagerService.cs:47:9
             });
         }
         public byte[] ConvertToBytes(IFormFile image)
-        {
-            BinaryReader reader = new BinaryReader(image.OpenReadStream());
-            var imageBytes = reader.ReadBytes((int)image.Length);
-            return imageBytes;
-        }
+        {}
 
         public List<CurrentUserDto> GetAllUsers()

[NoCoverage] Logical mutation
Services/UserManagerService.cs:57:80
         {
             return ExecuteInTransaction(uow =>
             {
-                return uow.IdentityUsers.Get().Include(w => w.Role).Where(u => u.IsDeleted.Equals(false) && !u.Role.Name.Equals("admin")).Select(u => new CurrentUserDto
+                return uow.IdentityUsers.Get().Include(w => w.Role).Where(u => u.IsDeleted.Equals(false) || !u.Role.Name.Equals("admin")).Select(u => new CurrentUserDto
                 {
                     Email = u.Email,

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Services/UserManagerService.cs:57:109
         {
             return ExecuteInTransaction(uow =>
             {
-                return uow.IdentityUsers.Get().Include(w => w.Role).Where(u => u.IsDeleted.Equals(false) && !u.Role.Name.Equals("admin")).Select(u => new CurrentUserDto
+                return uow.IdentityUsers.Get().Include(w => w.Role).Where(u => u.IsDeleted.Equals(false) && u.Role.Name.Equals("admin")).Select(u => new CurrentUserDto
                 {
                     Email = u.Email,

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
Services/UserManagerService.cs:62:29
                     Email = u.Email,
                     Name = u.Username,
                     UserImage = u.UserImage,
-                    Roles = uow.IdentityRoles.Get().Where(w => w.Id.Equals(u.RoleId)).Select(r => r.Name).FirstOrDefault(),
+                    Roles = uow.IdentityRoles.Get().Where(w => w.Id.Equals(u.RoleId)).Select(r => r.Name).First(),
                     Bio = u.Bio
                 }).ToList();

[NoCoverage] Block removal mutation
Services/UserManagerService.cs:70:9
         }
 
         public async Task<IdentityUser> GetUserById(Guid id)
-        {
-            //var user = await uow.IdentityUsers.Where(u => u.Id.Equals(id)).SingleOrDefaultAsync();
-            //return user;
-            return null;
-        }
+        {}
 
         public Task<IdentityUser> GetUserByEmail(string email)

[NoCoverage] Boolean mutation
Services/UserManagerService.cs:80:83
         {
             return ExecuteInTransaction(uow =>
             {
-                var user =  uow.IdentityUsers.Get().Where(u => u.IsDeleted.Equals(false) && u.Email.Equals(email)).SingleOrDefaultAsync();
+                var user =  uow.IdentityUsers.Get().Where(u => u.IsDeleted.Equals(true) && u.Email.Equals(email)).SingleOrDefaultAsync();
                 return user;
             });

[NoCoverage] Logical mutation
Services/UserManagerService.cs:80:64
         {
             return ExecuteInTransaction(uow =>
             {
-                var user =  uow.IdentityUsers.Get().Where(u => u.IsDeleted.Equals(false) && u.Email.Equals(email)).SingleOrDefaultAsync();
+                var user =  uow.IdentityUsers.Get().Where(u => u.IsDeleted.Equals(false) || u.Email.Equals(email)).SingleOrDefaultAsync();
                 return user;
             });

[NoCoverage] Linq method mutation (SingleOrDefault() to Single())
Services/UserManagerService.cs:90:28
         {
             return ExecuteInTransaction(uow =>
             {
-                var user = uow.IdentityUsers.Get().Where(u => u.IsDeleted.Equals(false) && u.Email.Equals(email)).Select(u => new CurrentUserDto
-                {
-                    Email = u.Email,
-                    Name = u.Username,
-                    UserImage = u.UserImage,
-                    Roles = uow.IdentityRoles.Get().Where(w => w.Id.Equals(u.RoleId)).Select(r => r.Name).FirstOrDefault()
-
-                }).SingleOrDefault();
+                var user = uow.IdentityUsers.Get().Where(u => u.IsDeleted.Equals(false) && u.Email.Equals(email)).Select(u => new CurrentUserDto
+                {
+                    Email = u.Email,
+                    Name = u.Username,
+                    UserImage = u.UserImage,
+                    Roles = uow.IdentityRoles.Get().Where(w => w.Id.Equals(u.RoleId)).Select(r => r.Name).FirstOrDefault()
+
+                }).Single();
                 return user;
             });

[NoCoverage] Boolean mutation
Services/UserManagerService.cs:90:82
         {
             return ExecuteInTransaction(uow =>
             {
-                var user = uow.IdentityUsers.Get().Where(u => u.IsDeleted.Equals(false) && u.Email.Equals(email)).Select(u => new CurrentUserDto
+                var user = uow.IdentityUsers.Get().Where(u => u.IsDeleted.Equals(true) && u.Email.Equals(email)).Select(u => new CurrentUserDto
                 {
                     Email = u.Email,

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
Services/UserManagerService.cs:95:29
                     Email = u.Email,
                     Name = u.Username,
                     UserImage = u.UserImage,
-                    Roles = uow.IdentityRoles.Get().Where(w => w.Id.Equals(u.RoleId)).Select(r => r.Name).FirstOrDefault()
+                    Roles = uow.IdentityRoles.Get().Where(w => w.Id.Equals(u.RoleId)).Select(r => r.Name).First()
 
                 }).SingleOrDefault();

[NoCoverage] Block removal mutation
Services/UserManagerService.cs:104:9
         }
 
         public CurrentUserWithAddressDto? GetUserInfoWithAddressByEmail(string email, string city)
-        {
-            return _userRepository.GetUserInfoWithAddressByEmailAndCity(email, city);
-        }
+        {}
 
         public  Guid GetUserByUsername(string username)

[NoCoverage] Boolean mutation
Services/UserManagerService.cs:112:83
         {
             return ExecuteInTransaction(uow =>
             {
-                var user =  uow.IdentityUsers.Get().Where(u => u.IsDeleted.Equals(false) && u.Username.Equals(username)).FirstOrDefault();
+                var user =  uow.IdentityUsers.Get().Where(u => u.IsDeleted.Equals(true) && u.Username.Equals(username)).FirstOrDefault();
                 return user.Id;
             });

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
Services/UserManagerService.cs:112:29
         {
             return ExecuteInTransaction(uow =>
             {
-                var user =  uow.IdentityUsers.Get().Where(u => u.IsDeleted.Equals(false) && u.Username.Equals(username)).FirstOrDefault();
+                var user =  uow.IdentityUsers.Get().Where(u => u.IsDeleted.Equals(false) && u.Username.Equals(username)).First();
                 return user.Id;
             });

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
Services/UserManagerService.cs:121:28
         {
             return ExecuteInTransaction(uow =>
             {
-                var user = uow.IdentityUsers.Get().Where(u => u.IsDeleted.Equals(false) && u.Email.Equals(email)).FirstOrDefault();
+                var user = uow.IdentityUsers.Get().Where(u => u.IsDeleted.Equals(false) && u.Email.Equals(email)).First();
                 return user.Id;
             });

[NoCoverage] Boolean mutation
Services/UserManagerService.cs:121:82
         {
             return ExecuteInTransaction(uow =>
             {
-                var user = uow.IdentityUsers.Get().Where(u => u.IsDeleted.Equals(false) && u.Email.Equals(email)).FirstOrDefault();
+                var user = uow.IdentityUsers.Get().Where(u => u.IsDeleted.Equals(true) && u.Email.Equals(email)).FirstOrDefault();
                 return user.Id;
             });

[NoCoverage] Logical mutation
Services/UserManagerService.cs:130:63
         {
             return ExecuteInTransaction(uow =>
             {
-                var user = uow.IdentityUsers.Get().Where(u => u.IsDeleted.Equals(false) && u.Email.Equals(email)).FirstOrDefault();
+                var user = uow.IdentityUsers.Get().Where(u => u.IsDeleted.Equals(false) || u.Email.Equals(email)).FirstOrDefault();
                 return user.Id;
             });

[NoCoverage] Boolean mutation
Services/UserManagerService.cs:142:46
             {
                 var selectedUserPropertiesObject = uow.IdentityUsers.Get()
               .AsNoTracking()
-              .Where(u => u.IsDeleted.Equals(false) && u.Email.Equals(email) )
+              .Where(u => u.IsDeleted.Equals(true) && u.Email.Equals(email) )
               .Select(selector)
               .SingleOrDefaultAsync(cancellationToken);

[NoCoverage] Logical mutation
Services/UserManagerService.cs:142:27
             {
                 var selectedUserPropertiesObject = uow.IdentityUsers.Get()
               .AsNoTracking()
-              .Where(u => u.IsDeleted.Equals(false) && u.Email.Equals(email) )
+              .Where(u => u.IsDeleted.Equals(false) || u.Email.Equals(email) )
               .Select(selector)
               .SingleOrDefaultAsync(cancellationToken);

[NoCoverage] Block removal mutation
Services/UserManagerService.cs:152:9
         }
 
         public async Task<IdentityUserToken> GetUserTokenByRefreshToken(string refreshtoken)
-        {
-            ///where refreshtokentime is still valid/ where numberofrefreshes < maxallowedtokenrefresh?
-            var userTokenObj = await UnitOfWork.IdentityUserTokens.Get().Where(ut => ut.RefreshTokenValue.Equals(refreshtoken)).SingleOrDefaultAsync();
-            return userTokenObj;
-        }
+        {}
 
         public async Task<T> GetUserTokensSelectedProperties<T>(string tokenValue, Expression<Func<IdentityUserTokenConfirmation, T>> selector, CancellationToken cancellationToken = default)

[NoCoverage] Linq method mutation (SingleOrDefault() to Single())
Services/UserManagerService.cs:169:28
         {
             return ExecuteInTransaction(uow =>
             {
-                var user = uow.IdentityUsers.Get()
-                                                .Where(m => m.Email.Equals(email))
-                                                .SingleOrDefault();
+                var user = uow.IdentityUsers.Get()
+                                                .Where(m => m.Email.Equals(email))
+                                                .Single();
                 if (user == null)
                 {

[NoCoverage] Equality mutation
Services/UserManagerService.cs:172:21
                 var user = uow.IdentityUsers.Get()
                                                 .Where(m => m.Email.Equals(email))
                                                 .SingleOrDefault();
-                if (user == null)
+                if (user != null)
                 {
                     return false;

[NoCoverage] Boolean mutation
Services/UserManagerService.cs:176:34
                 {
                     return false;
                 }
-                user.IsDeleted = true;
+                user.IsDeleted = false;
                 uow.IdentityUsers.Update(user);
                 uow.SaveChanges();

[NoCoverage] Statement mutation
Services/UserManagerService.cs:177:17
                     return false;
                 }
                 user.IsDeleted = true;
-                uow.IdentityUsers.Update(user);
+                ;
                 uow.SaveChanges();
                 return user.IsDeleted;

[NoCoverage] Statement mutation
Services/UserManagerService.cs:178:17
                 }
                 user.IsDeleted = true;
                 uow.IdentityUsers.Update(user);
-                uow.SaveChanges();
+                ;
                 return user.IsDeleted;
             });

[NoCoverage] Logical mutation
Services/UserManagerService.cs:190:73
             return ExecuteInTransaction(uow => {
 
                 var email = loginCommand.Email;
-                IdentityUser user =  uow.IdentityUsers.Get().Where(u => u.Email.Equals(loginCommand.Email) && u.IsDeleted == false).SingleOrDefault();
+                IdentityUser user =  uow.IdentityUsers.Get().Where(u => u.Email.Equals(loginCommand.Email) || u.IsDeleted == false).SingleOrDefault();
                 user = uow.IdentityUsers.Get().Include(u => u.Role)
                                .SingleOrDefault(u => u.Email.Equals(loginCommand.Email));

[NoCoverage] Linq method mutation (SingleOrDefault() to Single())
Services/UserManagerService.cs:190:38
             return ExecuteInTransaction(uow => {
 
                 var email = loginCommand.Email;
-                IdentityUser user =  uow.IdentityUsers.Get().Where(u => u.Email.Equals(loginCommand.Email) && u.IsDeleted == false).SingleOrDefault();
+                IdentityUser user =  uow.IdentityUsers.Get().Where(u => u.Email.Equals(loginCommand.Email) && u.IsDeleted == false).Single();
                 user = uow.IdentityUsers.Get().Include(u => u.Role)
                                .SingleOrDefault(u => u.Email.Equals(loginCommand.Email));

[NoCoverage] Linq method mutation (SingleOrDefault() to Single())
Services/UserManagerService.cs:191:24
 
                 var email = loginCommand.Email;
                 IdentityUser user =  uow.IdentityUsers.Get().Where(u => u.Email.Equals(loginCommand.Email) && u.IsDeleted == false).SingleOrDefault();
-                user = uow.IdentityUsers.Get().Include(u => u.Role)
-                               .SingleOrDefault(u => u.Email.Equals(loginCommand.Email));
+                user = uow.IdentityUsers.Get().Include(u => u.Role)
+                               .Single(u => u.Email.Equals(loginCommand.Email));
                 var  roles = user.Role.Name;
 

[NoCoverage] Equality mutation
Services/UserManagerService.cs:195:21
                                .SingleOrDefault(u => u.Email.Equals(loginCommand.Email));
                 var  roles = user.Role.Name;
 
-                if (user == null)
+                if (user != null)
                 {
                     string message = $"User with username or password = {loginCommand.Email}  was not found or your account is deleted";

[NoCoverage] String mutation
Services/UserManagerService.cs:197:38
 
                 if (user == null)
                 {
-                    string message = $"User with username or password = {loginCommand.Email}  was not found or your account is deleted";
+                    string message = $"";
                     throw new NotFoundException(nameof(IdentityUser), message);
                 }

[NoCoverage] Statement mutation
Services/UserManagerService.cs:198:21
                 if (user == null)
                 {
                     string message = $"User with username or password = {loginCommand.Email}  was not found or your account is deleted";
-                    throw new NotFoundException(nameof(IdentityUser), message);
+                    ;
                 }
 

[NoCoverage] Negate expression
Services/UserManagerService.cs:204:21
 
                 string initialsalt = user.PasswordHash.Split('.')[1];
                 bool isPasswordVerified = _hashAlgo.IsPasswordVerified(user.PasswordHash, initialsalt, loginCommand.Password);
-                if (isPasswordVerified)
+                if (!(isPasswordVerified))
                 {
 

[NoCoverage] Block removal mutation
Services/UserManagerService.cs:205:17
                 string initialsalt = user.PasswordHash.Split('.')[1];
                 bool isPasswordVerified = _hashAlgo.IsPasswordVerified(user.PasswordHash, initialsalt, loginCommand.Password);
                 if (isPasswordVerified)
-                {
-
-                    //  var userL = GetUserById(user.Id);
-
-                    //  updateUser(user);
-
-                    var newJti = Guid.NewGuid().ToString();
-                    var tokenHandler = new JwtSecurityTokenHandler();
-                    //usersecret
-                    var signinKey = new SymmetricSecurityKey(Encoding.UTF8.GetBytes(_signInKeySetting.SecretSignInKeyForJwtToken));
-                    //int usedRefreshes = -1;
-                    var tokenresult = _tokenManager.GenerateTokenAndRefreshToken(signinKey, user, roles, tokenHandler, newJti);
-                    //var refreshToken = _tokenManager.GenerateRefreshToken();
-
-
-
-                    TokenWrapper tokenwrapper = new TokenWrapper();
-                    tokenwrapper.Token = tokenresult.Item1;
-                    tokenwrapper.RefreshToken = tokenresult.Item2;
-
-
-                    return tokenwrapper;
-                }
+                {}
                 throw new IncorrectPasswordException("Wrong Password");
             });

[NoCoverage] Statement mutation
Services/UserManagerService.cs:228:17
 
                     return tokenwrapper;
                 }
-                throw new IncorrectPasswordException("Wrong Password");
+                ;
             });
 

[NoCoverage] String mutation
Services/UserManagerService.cs:228:54
 
                     return tokenwrapper;
                 }
-                throw new IncorrectPasswordException("Wrong Password");
+                throw new IncorrectPasswordException("");
             });
 

[NoCoverage] Linq method mutation (SingleOrDefault() to Single())
Services/UserManagerService.cs:241:29
         {
             ExecuteInTransaction(uow =>
             {
-                var user =  uow.IdentityUsers.Get().Where(u => u.Email.Equals(registerCommand.Email)).SingleOrDefault();
+                var user =  uow.IdentityUsers.Get().Where(u => u.Email.Equals(registerCommand.Email)).Single();
                 if (user != null)
                 {

[NoCoverage] Equality mutation
Services/UserManagerService.cs:242:21
             ExecuteInTransaction(uow =>
             {
                 var user =  uow.IdentityUsers.Get().Where(u => u.Email.Equals(registerCommand.Email)).SingleOrDefault();
-                if (user != null)
+                if (user == null)
                 {
                     string message = "Username=" + registerCommand.Email + " already registered";

[NoCoverage] String mutation
Services/UserManagerService.cs:244:76
                 var user =  uow.IdentityUsers.Get().Where(u => u.Email.Equals(registerCommand.Email)).SingleOrDefault();
                 if (user != null)
                 {
-                    string message = "Username=" + registerCommand.Email + " already registered";
+                    string message = "Username=" + registerCommand.Email + "";
                     throw new UserAlreadyRegisteredException(nameof(IdentityUser), message);
                 }

[NoCoverage] String mutation
Services/UserManagerService.cs:244:38
                 var user =  uow.IdentityUsers.Get().Where(u => u.Email.Equals(registerCommand.Email)).SingleOrDefault();
                 if (user != null)
                 {
-                    string message = "Username=" + registerCommand.Email + " already registered";
+                    string message = "" + registerCommand.Email + " already registered";
                     throw new UserAlreadyRegisteredException(nameof(IdentityUser), message);
                 }

[NoCoverage] Statement mutation
Services/UserManagerService.cs:245:21
                 if (user != null)
                 {
                     string message = "Username=" + registerCommand.Email + " already registered";
-                    throw new UserAlreadyRegisteredException(nameof(IdentityUser), message);
+                    ;
                 }
                 else

[NoCoverage] String mutation
Services/UserManagerService.cs:253:73
                     registerUser.Id = Guid.NewGuid();
                     registerUser.Email = registerCommand.Email;
                     registerUser.PhoneNumber = registerCommand.PhoneNumber;
-                    registerUser.Username = registerCommand.FirstName + " " + registerCommand.LastName;
+                    registerUser.Username = registerCommand.FirstName + "" + registerCommand.LastName;
                     string result = _hashAlgo.CalculateHashValueWithInput(registerCommand.Password);
                    // registerUser.UserImage = ConvertToBytes(registerCommand.UserImage);

[NoCoverage] Boolean mutation
Services/UserManagerService.cs:259:45
                     registerUser.Bio = registerCommand.Bio;
                     registerUser.EducationalInstitution = registerCommand.EducationalInstitution;
                     registerUser.CreatedAt = DateTime.UtcNow;
-                    registerUser.IsActive = true;
+                    registerUser.IsActive = false;
                     registerUser.IsDeleted = false;
                     registerUser.RoleId = uow.IdentityRoles.Get().Where(r => r.Name.Equals(registerCommand.Role)).Select(r => r.Id).FirstOrDefault();

[NoCoverage] Boolean mutation
Services/UserManagerService.cs:260:46
                     registerUser.EducationalInstitution = registerCommand.EducationalInstitution;
                     registerUser.CreatedAt = DateTime.UtcNow;
                     registerUser.IsActive = true;
-                    registerUser.IsDeleted = false;
+                    registerUser.IsDeleted = true;
                     registerUser.RoleId = uow.IdentityRoles.Get().Where(r => r.Name.Equals(registerCommand.Role)).Select(r => r.Id).FirstOrDefault();
                     var location = new Adress();

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
Services/UserManagerService.cs:261:43
                     registerUser.CreatedAt = DateTime.UtcNow;
                     registerUser.IsActive = true;
                     registerUser.IsDeleted = false;
-                    registerUser.RoleId = uow.IdentityRoles.Get().Where(r => r.Name.Equals(registerCommand.Role)).Select(r => r.Id).FirstOrDefault();
+                    registerUser.RoleId = uow.IdentityRoles.Get().Where(r => r.Name.Equals(registerCommand.Role)).Select(r => r.Id).First();
                     var location = new Adress();
                     location.Id = Guid.NewGuid();

[NoCoverage] Statement mutation
Services/UserManagerService.cs:275:25
                     if (result != null)
                     {
                         registerUser.PasswordHash = result;
-                        uow.IdentityUsers.Insert(registerUser);
+                        ;
 
 

[NoCoverage] Statement mutation
Services/UserManagerService.cs:280:25
 
                         //  var id = await uow.IdentityUsers.Where(u => u.Email.Equals(registerCommand.Email)).Select(u => u.Id).SingleOrDefaultAsync();
                         //var roleid = Guid.NewGuid();
-                        uow.IdentityUsers.Insert(registerUser);
+                        ;
                         if (registerCommand.Role == "Student")
                         {

[NoCoverage] Equality mutation
Services/UserManagerService.cs:281:29
                         //  var id = await uow.IdentityUsers.Where(u => u.Email.Equals(registerCommand.Email)).Select(u => u.Id).SingleOrDefaultAsync();
                         //var roleid = Guid.NewGuid();
                         uow.IdentityUsers.Insert(registerUser);
-                        if (registerCommand.Role == "Student")
+                        if (registerCommand.Role != "Student")
                         {
                             var student = new Student();

[NoCoverage] String mutation
Services/UserManagerService.cs:281:53
                         //  var id = await uow.IdentityUsers.Where(u => u.Email.Equals(registerCommand.Email)).Select(u => u.Id).SingleOrDefaultAsync();
                         //var roleid = Guid.NewGuid();
                         uow.IdentityUsers.Insert(registerUser);
-                        if (registerCommand.Role == "Student")
+                        if (registerCommand.Role == "")
                         {
                             var student = new Student();

[NoCoverage] Statement mutation
Services/UserManagerService.cs:287:29
                             student.Id = registerUser.Id;
                             student.StudentGrade = 0;
                             student.StudentSchoolQualification = "";
-                            uow.Students.Insert(student);
+                            ;
                         }
                         if (registerCommand.Role == "Mentor")

[NoCoverage] Equality mutation
Services/UserManagerService.cs:289:29
                             student.StudentSchoolQualification = "";
                             uow.Students.Insert(student);
                         }
-                        if (registerCommand.Role == "Mentor")
+                        if (registerCommand.Role != "Mentor")
                         {
                             var mentor = new Mentor();

[NoCoverage] Array initializer mutation
Services/UserManagerService.cs:293:62
                         {
                             var mentor = new Mentor();
                             mentor.Id = registerUser.Id;
-                            mentor.MentorIdentityCardFront = new byte[] { 0x10, 0x10, 0x10, 0x10, 0x10, 0x10, 0x10 }; 
+                            mentor.MentorIdentityCardFront = new byte[] {}; 
 
                             mentor.MentorIdentityCardBack = new byte[] { 0x10, 0x10, 0x10, 0x10, 0x10, 0x10, 0x10 };

[NoCoverage] Array initializer mutation
Services/UserManagerService.cs:295:61
                             mentor.Id = registerUser.Id;
                             mentor.MentorIdentityCardFront = new byte[] { 0x10, 0x10, 0x10, 0x10, 0x10, 0x10, 0x10 }; 
 
-                            mentor.MentorIdentityCardBack = new byte[] { 0x10, 0x10, 0x10, 0x10, 0x10, 0x10, 0x10 };
+                            mentor.MentorIdentityCardBack = new byte[] {};
                             uow.Mentors.Insert(mentor);
                         }

[NoCoverage] Statement mutation
Services/UserManagerService.cs:296:29
                             mentor.MentorIdentityCardFront = new byte[] { 0x10, 0x10, 0x10, 0x10, 0x10, 0x10, 0x10 }; 
 
                             mentor.MentorIdentityCardBack = new byte[] { 0x10, 0x10, 0x10, 0x10, 0x10, 0x10, 0x10 };
-                            uow.Mentors.Insert(mentor);
+                            ;
                         }
                         uow.Adress.Insert(location);

[NoCoverage] Statement mutation
Services/UserManagerService.cs:298:25
                             mentor.MentorIdentityCardBack = new byte[] { 0x10, 0x10, 0x10, 0x10, 0x10, 0x10, 0x10 };
                             uow.Mentors.Insert(mentor);
                         }
-                        uow.Adress.Insert(location);
+                        ;
                         //uow.IdentityRoles.Insert(new IdentityUserIdentityRole(registerUser.Id, roleid));
                         uow.SaveChanges();

[NoCoverage] Statement mutation
Services/UserManagerService.cs:300:25
                         }
                         uow.Adress.Insert(location);
                         //uow.IdentityRoles.Insert(new IdentityUserIdentityRole(registerUser.Id, roleid));
-                        uow.SaveChanges();
+                        ;
 
                     }

[NoCoverage] Statement mutation
Services/UserManagerService.cs:316:17
         {
             return ExecuteInTransaction(uow =>
             {
-                uow.IdentityUsers.Update(user);
+                ;
                 uow.SaveChanges();
                 return user;

[NoCoverage] Linq method mutation (SingleOrDefault() to Single())
Services/UserManagerService.cs:328:35
         {
             return ExecuteInTransaction(uow =>
             {
-                var updatedUser = uow.IdentityUsers.Get()
-                    .Include(a => a.Adress)
-                    .Where(u => u.Email.Equals(email))
-                    .SingleOrDefault();
+                var updatedUser = uow.IdentityUsers.Get()
+                    .Include(a => a.Adress)
+                    .Where(u => u.Email.Equals(email))
+                    .Single();
 
                 updatedUser.Username = user.Username;

[NoCoverage] Statement mutation
Services/UserManagerService.cs:343:17
                 updatedUser.Adress.City = user.City;
                 updatedUser.Adress.County = user.County;
 
-                uow.IdentityUsers.Update(updatedUser);
+                ;
                 uow.SaveChanges();
                 return true;
