[NoCoverage] Linq method mutation (FirstOrDefault() to First())
Services/VideoCallService.cs:25:33
             return ExecuteInTransaction(uow =>
             {
                 var info = new VideoMeetingDetails();
-                var studentId = uow.IdentityUsers.Get().Where(s => s.Email.Equals(model.StudentEmail)).Select(s => s.Id).FirstOrDefault();
+                var studentId = uow.IdentityUsers.Get().Where(s => s.Email.Equals(model.StudentEmail)).Select(s => s.Id).First();
                 var mentorId = uow.IdentityUsers.Get().Where(s => s.Email.Equals(model.MentorEmail)).Select(s => s.Id).FirstOrDefault(); ;
                 /*var link = uow.VideoMeetingsDetails.Get().Where(v => v.MentorId.Equals(mentorId) && v.StudentId.Equals(studentId));

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
Services/VideoCallService.cs:26:32
             {
                 var info = new VideoMeetingDetails();
                 var studentId = uow.IdentityUsers.Get().Where(s => s.Email.Equals(model.StudentEmail)).Select(s => s.Id).FirstOrDefault();
-                var mentorId = uow.IdentityUsers.Get().Where(s => s.Email.Equals(model.MentorEmail)).Select(s => s.Id).FirstOrDefault(); ;
+                var mentorId = uow.IdentityUsers.Get().Where(s => s.Email.Equals(model.MentorEmail)).Select(s => s.Id).First(); ;
                 /*var link = uow.VideoMeetingsDetails.Get().Where(v => v.MentorId.Equals(mentorId) && v.StudentId.Equals(studentId));
 

[NoCoverage] String mutation
Services/VideoCallService.cs:44:29
                 info.StudentId = studentId;
                 info.MeetingTime = DateTime.Now;
                 info.Link = model.Link;
-                info.Dial = "no content";
+                info.Dial = "";
                 //info.Dial = model.Dial;
                 uow.VideoMeetingsDetails.Insert(info);

[NoCoverage] Statement mutation
Services/VideoCallService.cs:46:17
                 info.Link = model.Link;
                 info.Dial = "no content";
                 //info.Dial = model.Dial;
-                uow.VideoMeetingsDetails.Insert(info);
+                ;
                 //}
                 uow.SaveChanges();

[NoCoverage] Statement mutation
Services/VideoCallService.cs:48:17
                 //info.Dial = model.Dial;
                 uow.VideoMeetingsDetails.Insert(info);
                 //}
-                uow.SaveChanges();
+                ;
                 return info;
 

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
Services/VideoCallService.cs:58:33
         {
             return ExecuteInTransaction(uow =>
             {
-                var studentId = uow.IdentityUsers.Get().Where(s => s.Email.Equals(studentEmail)).Select(s => s.Id).FirstOrDefault();
+                var studentId = uow.IdentityUsers.Get().Where(s => s.Email.Equals(studentEmail)).Select(s => s.Id).First();
 
                 var result = uow.VideoMeetingsDetails.Get()

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
Services/VideoCallService.cs:65:71
                                                      .Where(s => s.StudentId.Equals(studentId))
                                                     .Select(s => new StudentVideoCallInfoDTO
                                                     {
-                                                        MentorEmail = uow.IdentityUsers.Get().Where(m => m.Id.Equals(s.MentorId)).Select(m => m.Email).FirstOrDefault(),
+                                                        MentorEmail = uow.IdentityUsers.Get().Where(m => m.Id.Equals(s.MentorId)).Select(m => m.Email).First(),
                                                         MentorName = uow.IdentityUsers.Get().Where(m => m.Id.Equals(s.MentorId)).Select(m => m.Username).FirstOrDefault(),
                                                         Subject = s.Mentor.Announcements.Where(m => m.MentorId.Equals(s.MentorId)).Select(s => s.Subject).First(),

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
Services/VideoCallService.cs:66:70
                                                     .Select(s => new StudentVideoCallInfoDTO
                                                     {
                                                         MentorEmail = uow.IdentityUsers.Get().Where(m => m.Id.Equals(s.MentorId)).Select(m => m.Email).FirstOrDefault(),
-                                                        MentorName = uow.IdentityUsers.Get().Where(m => m.Id.Equals(s.MentorId)).Select(m => m.Username).FirstOrDefault(),
+                                                        MentorName = uow.IdentityUsers.Get().Where(m => m.Id.Equals(s.MentorId)).Select(m => m.Username).First(),
                                                         Subject = s.Mentor.Announcements.Where(m => m.MentorId.Equals(s.MentorId)).Select(s => s.Subject).First(),
                                                         MeetingTime = s.MeetingTime,

[NoCoverage] Linq method mutation (First() to FirstOrDefault())
Services/VideoCallService.cs:67:67
                                                     {
                                                         MentorEmail = uow.IdentityUsers.Get().Where(m => m.Id.Equals(s.MentorId)).Select(m => m.Email).FirstOrDefault(),
                                                         MentorName = uow.IdentityUsers.Get().Where(m => m.Id.Equals(s.MentorId)).Select(m => m.Username).FirstOrDefault(),
-                                                        Subject = s.Mentor.Announcements.Where(m => m.MentorId.Equals(s.MentorId)).Select(s => s.Subject).First(),
+                                                        Subject = s.Mentor.Announcements.Where(m => m.MentorId.Equals(s.MentorId)).Select(s => s.Subject).FirstOrDefault(),
                                                         MeetingTime = s.MeetingTime,
                                                         Link = s.Link,
